[
    {
      "url": "/speaking/part-2/describe-a-book-you-have-read-you-should-say/",
      "content": "1.What kind of book it is?\n2.When you read it?\n3.What is about?\n4.And explain why you think it is exciting?\nBooks play an essential role in every student’s/ person’s life because books providing knowledge of the outside world, introduce them to a world of imagination, improving their reading, writing and speaking skills, and boosting memory and intelligence. I like to read motivational, story and investigation related books.\nToday, I would like to talk about a crime and investigation related book. The book name is “Crime and Punishment”. It is a novel written by the Russian author Fyodor Dostoevsky. It was first published in the literary journal The Russian Messenger in twelve monthly instalments during 1866. It is a murder storybook that is told from a murder’s point of view.\nPeople did work and study from home. Due to the pandemic, everyone stayed at home last year. At that time, I had much free time, so to utilize the free time, I started to read a different kinds of books. As I said earlier, I like investigation and crime-related books, so I downloaded some books online, and crime and punishment were one of these books.\nBook explain a murder’s point of view, behaviour, emotions before and after the murder. The novel’s first masterpiece is a psychological analysis of a person, who thinks that he is an extraordinary/ very unusual person able to take on the spiritual(relating to soul or human spirit as opposed to material or physical things) responsibility of using evil means to achieve.\nI am keen to know different types of behaviour, and this book helped me to let know the unique feeling and emotions of murder, so that’s why I think it is an exciting book."
    },
    {
      "url": "/speaking/part-2/describe-a-book-you-want-to-read-in-the-future/",
      "content": "You should say:\n\n\nwhat book it is\n\n\nwhen you plan to read it\n\n\nif you would like to read other books by the same author\n\n\nI have heard a lot about one of the legendary authors of all time, who is famously known as William Shakespeare, but, unfortunately, I am yet to read many of his books. Of course, it is not like I have read books of all famous writers in the world, but this gentleman deserves an extra bit of attention from all the book lovers around the world, simply because he is widely regarded as the greatest writer in the English language and the world’s greatest dramatist.\nThe book, I want to read by this author, is called The “Tragedy of Hamlet, Prince of Denmark”, which is often shortened to Hamlet. The book is a tragedy, which was written by this legendary English poet, sometime between 1599 and 1601.\nBy the way, it also happens to be Shakespeare’s longest play with 30,557 words. And, the book tells about a revenge story, based on a popular legend, where the ghost of a murdered king comes to haunt the living with tragic consequences. Of course, in the story, the ghost doesn’t take the revenge himself, but rather he asks his own son, Hamlet, to avenge his murder by killing the new king, Hamlet’s uncle. Hamlet feigns madness, contemplates life and death, and seeks revenge. His uncle, fearing for his life, also devises plots to kill Hamlet. At the end of the story, a fight breaks out where the King, Queen, Hamlet’s opponent and Hamlet himself are all killed.\nI am not only planning to read this particular book in the next few months but also another book called “The Merchant of Venice” by this same author.\nWell, I want to read this book, mainly because I want to learn a little more about 16th century England and Europe as a whole. I want to read this book also because it is considered to be one of the greatest tragedies, ever written, as well as the greatest play of England’s national poet, who pretty much changed the landscape of English literature forever.  Finally, I want to read this book also because it will further enrich my English language skills, I believe."
    },
    {
      "url": "/speaking/part-2/describe-a-city-you-have-visited-and-liked-you-should-say/",
      "content": "1.what city it is, and where it is\n2.when you have visited this city\n3.why you liked/disliked it\n4.and explain what influences the city has had on you.\nI have visited several cities before, and they were all amazing in their own rights. However, there was one city which, I think, should be specifically mentioned here because I was not too sure about visiting it until the last moment. In fact, I heard a lot of negative comments about this particular city before visiting it about a year ago, but I was proved wrong when I actually visited it. The name of this city is “Milan”. I think that we all know where the city of Milan is. But, still, just to refresh our memory a little about this city, it is one of Italy’s major metropolis cities in its northern Lombardy region. Milan is also a major financial hub which is known for its high-end shops and restaurants. And, of course, it is known as the capital of the fashion world also. Anyway, I visited this city recently, about a few months ago. Contrary to popular belief, Milan has a lot of wonderful and modern architectures for a city which was bombed rather heavily during the Second World War. Besides, visiting Lake Como, which was only an hour (by train) from Milan, was one of my best experiences ever. In fact, Lake Como, in my opinion, is one of the most beautiful places on earth with its mountains and colourful villas. Milan has also some of the most beautiful and green public parks in the world, in my opinion. One of my favourite green spaces in Milan was the Library of Trees, which contains more than 100 species of trees. However, there is one thing that I didn’t like about Milan was that it was rather expensive. Anyway, all in all, I would say that visiting Milan was a great experience. Even though it is a bustling city with a lot of activities, I think that there is a lot of life in it and people in its different neighbourhoods tend to enjoy their life to the fullest. I think that I would go back to visit that city again in future."
    },
    {
      "url": "/speaking/part-2/describe-a-conversation-that-you-spoke-in-english-first-time/",
      "content": "You should say:\n\n\nwhat the situation was\n\n\nwhere you were who you communicated with\n\n\nand explain why you used a foreign language to communicate on this occasion\n\n\nI have been learning English for a long time, but I haven’t had many chances to practice speaking English with native speakers. To the best of my recollection, the first time I used it was on Christmas Eve three years ago.\nAt that time, I was hanging out with my friends. Suddenly, a foreigner came up to me and asked for directions to a supermarket. Honestly, he spoke too quickly for me to catch everything. But after he repeated his words, I finally understood and showed him the way to the nearest supermarket.\nI used body language a lot to explain the directions to him, since I didn’t speak English well then. After that, he said “Thank you” to me and headed for the supermarket. I realize that English plays an important role in our life, despite the fact that we don’t live in English-speaking countries. It is spoken globally and it’s becoming the dominant language. Therefore, I have been trying to practice speaking English daily, so that I can have a good command over the language, and I can confidently hold conversations with foreigners, no matter the topic of conversation."
    },
    {
      "url": "/speaking/part-2/describe-a-happy-childhood-event-you-remember-you-should-say/",
      "content": "1.What it is?\n2.When it happened?\n3.How you felt at the time?\n4.and explain why you remember this particular occasion.\nWhen I was a child, I experienced a notable number of events but not all of them were happy. I also cannot remember all of them clearly. But I will always remember the event of receiving a large birthday present. It was a remote-controlled car that I had long been desiring for. My father presented me with the gift and it was a surprise for me indeed. I was too happy with the gift that I played with the car for the remaining parts of the day. Even I forgot to take my regular meals too. In fact, it was the best present ever I received in my life and also makes me remember of my childhood. On that day, I was taking preparations from the early part of the day to celebrate the event. Guests started to arrive in the evening. But the number of guests were limited. Only the family members, some intimate relatives and some of the business partners of my dad. But the number of invited guests crossed 20 and it was difficult to manage everything, particularly the entertainment issue of the guests. However, my dad managed everything. The invited guests also brought gifts for me marking the fifth birthday of mine.\nTo be frank, I was overjoyed with the matter. I was amazed at the gifts and the people present there also greeted me in various ways. The decision to celebrate my birthday was taken a couple of days ago, and I was joyed hearing the news. Since I was a small kid, I did not know actually the meaning of celebrating a birthday but enjoyed blowing the candles and cutting the cake. My parents had been celebrating the day from my early age but once I crossed my teenage, I actually find no interest in such activities. The feelings in my childhood were really great about the issue. I can remember this particular event as I received the most impressive gift of my life. I have celebrated many of my birthdays but that one was the best. I was greatly happy with the people and presents. To be honest, I had never received such great gifts after that birthday celebration. Besides, I enjoyed the company of other people and the foods were delicious. I still can remember the day when my parents fed me the birthday cake and everyone clapped around us.\nIt was the most special day of my life. Not only the gifts, I was blessed by everyone present at the event. In fact, it was the best ever birthday celebration of my life. So, it is still vivid in my memory."
    },
    {
      "url": "/speaking/part-2/describe-a-meal-you-enjoyed/",
      "content": "You should say:\n1. When and where you have had this meal?\n2. With whom you ate this meal?\n3. What you ate?\n4. and explain why you enjoyed this meal so much.\nI went to visit (…say a city or country name here…) last year and stayed there for about 25 days. I travelled there for some professional reason and stayed at three different hotels during my stay there. There I enjoyed a meal to a great extent, and for this topic, I would like to talk about this meal and my experience of it.\nThe food habits of people in this city/ country were very much different than what I usually eat in our city/country. Since I had to stay there for a while, it was a bit difficult for me to enjoy all the meals I was eating. Not that I disliked all the foods I ate there, but the food that was easily available around me was something I ate but did not enjoy much.\nAfter a few days, I went to visit one of my relatives on a weekend there. To my surprise, they prepared one of my favourite meals. It is a signature meal in our city/country. That was a surprise and I was so overwhelmed with joy to see that they have prepared the meal with such care and affection. The four family members and I ate together and I ate voraciously as I enjoyed the taste and flavour of every single food item they had served.\nI ate dinner at this relative’s house. I ate (…say some of your favourite food items’ names here…) and I enjoyed the way those food items were cooked and served. It was like eating a beloved food after a really long time. I was a bit ashamed that I ate a bit more food than I usually do at dinner time.\nI enjoyed the meal because they were so delicious and I ate them after a while. They were also some of my favourite menus from my city/country. So when I ate some of my favourite foods all of a sudden, in a land far away from my home, I got a bit nostalgic! Moreover, my relative and her husband had been very cordial and I enjoyed their company and the way they served me the dish. Overall, it was a great meal with some really lovely and happy people."
    },
    {
      "url": "/speaking/part-2/describe-a-memorable-journey/",
      "content": "You should say:\n\n\nwhere you went\n\n\nhow you travelled\n\n\nwhy you went on the journey\n\n\nand explain why you remember this journey well.\nA journey is always pleasant to me. It not only gives us entertainment, it is helpful to teach over different unknown issues as well. The most important benefit of travelling is the excellent opportunity to gather knowledge. The knowledge earned in first hand experienced cannot be found on books or any other place. So, people like to travel and it a trend for a long past. But sometimes the journeys are not pleasant and the travellers have to undergo different unexpected situation during the trips.\nRecently I have made a train journey and it was the most thrilling event in my life as I have never ridden on trains before. I went to join at the marriage ceremony of one of my intimate friends who has passed his childhood days with me. The area where the friend is getting married is at the farthest part of the country and requires trains to reach there.\nFourteen of our childhood friends planned to reach the village marking the marriage and accordingly we bought fourteen train tickets for the purpose. My friends and his family members had started for the village earlier before our journey. On the planned night of the journey, we got out of home reached the railway station to catch the train. But interestingly the train was half an hour late due to an accident on its way to the railway station. We all rode the train and finally, the journey at night on a train begins.\nIt was the most thrilling experience in my life I have ever made so far. It was highly enjoyable to me due to the nature of the journey. I used to hear experiences of people attentively when they described their experiences about the train journeys but could not ride on a train due to different reasons. So, when the other childhood mates made the plan, I was the only one of them who jumped out of joy.\nThe journey is truly substantial one for me. It was a moonlit night when the train started and my seat was just beside the window. I looked at the full moon and it appeared that I am floating on the heaven with a great speed. The trees were passing us fast and the illuminated distant localities appeared like stars to me, shining on the large sky. The deep emotions that I felt on the night journey are inexpressible."
    },
    {
      "url": "/speaking/part-2/describe-a-newspaper-or-a-magazine/",
      "content": "You should say:\n\n\nwhat it is and why you read it\n\n\nwhat are the benefits of reading a newspaper or a magazine\n\n\nhow often you read it and what types of reports it contains\n\n\nand explain why do you like to read this newspaper or magazine.\nThe history of the newspaper goes back to the 17th century when arguably the very first newspaper called “The Oxford Gazette” was ever printed in its current format in 1665. Since then, centuries have passed, and many earth-shattering events have taken place to change the world, but the appeal of newspapers hasn’t diminished. In fact, they have actually gained more popularity among their readers with their “online edition”, such as “BBC online news”, which I am about to talk now.\nI read BBC online news at least once a day as it contains pretty much all kinds of news from all over the world. Whether we are talking about the latest fashion trends and style or some of the oldest handicraft items in some unknown part of the world, BBC online news has it all. The news portal doesn’t shy away from talking about controversial political, cultural, spiritual, social and economic issues either which are shaping up our world and opinion on a continuous basis one way or another. It also publishes news on all kinds of sports and international travel activities in as much details as possible. One of the main benefits of reading BBC online is that it gets updated every hour, if not every minute, to bring us the latest news. Besides, we don’t really have to pay any extra money to read them except only the charge for using the internet. Another benefit of reading an online newspaper is that they are more “interactive” as they let their readers publish their views online without any major delay.  \nAnyway, I like to read BBC online news mainly because it is widely “trusted” all over the world. In fact, it goes to great length to display pictures and videos of news subjects and events in order to prove their authenticity, which may not be found in some other newspapers. Besides, I also like the fact that it has two editions of the website: a UK edition, which gives prominence to UK stories, and an international edition, which prioritises international news for its international readers like me."
    },
    {
      "url": "/speaking/part-2/describe-a-photo-of-yourself-that-you-like/",
      "content": "You should say:\n1. Where you took it\n2. When you took the photo\n3. How you took it\n4. And explain how you felt about the photo.\nA picture is worth a thousand memories because one glance at an image can bring back thousands of stories and memories that one might have otherwise forgotten about. In addition, photographs remind of excellent experiences that one might have had in that specific period of time. Here, I’d like to talk about a photo of myself which I really admire.\nA couple of months back in autumn, I completed one of my wishes to travel to Leh-Ladakh by Royal Enfield. The road trip was such an exhilarating experience, with routes covered in barren mountain slopes, rocky terrains, snow-clad peaks, and other picturesque views, which urged me to click pictures on every turn. So, around three in the afternoon, when the sun was candescent, I reached the top of Khardung La. I saw many other bikers clicking panoramic pictures with the snow-clad mountains as the backdrop. Being an avid photographer, I couldn’t resist myself, so I parked my bike aside and eventually grabbed my tripod and iPhone 12 Pro Max to click the best aesthetic landscape pictures.\nWith remarkable features like time rewind, wide-angle lens, image stabilizer, dual-LED, HDR, and low light photo mode, I captured some exceptional pictures and selfies. Apart from that, a professional photographer clicked the shots of travellers upon registration, so I registered. Surprisingly, my turn came in at around 5 in the evening when the sun was slowly moving towards the west to set. I insisted on the photographer clicking the photographs since I didn’t want to miss the sunset as the backdrop in my portrait, which came out perfectly well.\nNow, when I look at the collection of incredible photos, it brings a broad smile to my face and makes me ponder the old saying, which says that there’s beauty everywhere, and all we need to do is look around and capture it in its true essence."
    },
    {
      "url": "/speaking/part-2/describe-a-piece-of-electronic-equipment-that-you-find-useful/",
      "content": "You should say:\n\n\nwhat it is\n\n\nhow you learned to use it\n\n\nhow long you have had it\n\n\nSometimes, I think that if this particular electronic equipment were invented during the middle ages or little later, it surely would have been considered as one of the 7th wonders of the old world by replacing one of the existing ones. Today, I would like to talk about a piece of wonderful electronic equipment which I think deserves a lot more credit than we are ready to give.\nThis electronic equipment is called the mighty “vacuum cleaner”. Of course, we might not just call it “mighty” because we are probably too much used to working with it, but if we can just manage our world for a week without a vacuum cleaner, I am sure that we would gladly change your mind about putting the word “mighty” before a vacuum cleaner.\nAnyway, so what is exactly so special about a vacuum cleaner? Well, we can answer this question by simply saying that this incredible equipment helps me clean my home and office, and all other places between them, and put them in order through the mechanism of an air pump and a suction device inside it. Now, even though, we have this equipment at our home since the time I can remember about things, but I didn’t really learn to use it until after I had started high school. Of course, for that, I will have to thank my elder sister since it was her who taught me how to switch it on and manoeuvre it on the floor and carpet to suck the dirt off them. By the way, unlike other vacuum cleaners, the one we have at home is lightweight and rather easy to operate on all kinds of surfaces.\nAnyway, I find this electronic equipment really useful, mainly because it helps me and my family keep our home dirt-free and clean without using too much of our efforts and time. The equipment is useful also because it helps us save a significant amount of money since we don’t have to hire any cleaning person to clean our home."
    },
    {
      "url": "/speaking/part-2/describe-a-positive-change-in-your-life/",
      "content": "1.What the change was about\n2.When it happened\n3.details of the change happened\n4.and how it affected you later in life\nThe positive change that I would like to talk about is ‘I started playing outdoor games instead of playing computer games’. After I got my first personal computer when I was only 9 years old or so, I started learning many things. Besides that, I started playing computer games. As computer games are addictive I found that I was playing the games whenever I had spare times. This addiction barred me from playing outdoor games like cricket, football etc. I found myself very much attracted to computer games and I preferred to play the games at home instead of going to open spaces or fields to participate in outdoor games that involve physical exercises. Not that computer games are all so bad, but playing them all the time someone\nhas got is not a good thing especially for kids. I found that I was spending more times at home than being outside. After my parents noticed that, they discussed with me about that and explained to me the importance of outdoor activities. They gave me strict restriction that I would only be able to play computer games for an hour daily and in the evening I’d have to go outside to play with my friends.\nThis was obviously a very positive change for me. I’m not against computer games but I feel that if there are more important things to do, then we should not spend time on computer games only.\nThis change affected me very positively. I became a good cricket player, later on, I started maintaining my times more prudently and I am sure this change has affected me positively in terms of physical and mental health."
    },
    {
      "url": "/speaking/part-2/describe-a-sport-that-you-want-to-learn/",
      "content": "You should say:\n\n\nwhat sport it is\n\n\nhow you plan to learn it\n\n\nhow difficult you think it would be to learn\n\n\n and explain why you would like to learn to play this sport. \nThank you for this great topic and the opportunity to let me talk about a sport that I would like to learn to play.\nWell, I love to take part in different indoor sports and games, and I am considering learning “table tennis” soon. It is an excellent sport, and it requires a set of skills to play well. In my view, table tennis is an exciting sport, and it is a good way of doing daily exercise as an extensive amount of movement is required to play it.\nI am planning to learn it at the university where I am currently studying. In fact, our university has a nice arrangement to learn and play table tennis. A good number of students take part in it every day, and among them, I have some of my classmates as well. They have assured me that they would spare some time each day to teach me how to play it, and offer me some tips on how to play well and win the game. I am actually counting on them. Besides, I am planning to watch some YouTube video tutorials on how to play table tennis properly.\nI believe learning the basics to play table tennis would not be much difficult for me. But I am also convinced that playing like a professional is quite tough as it requires dedication, a lot of practice, and skills. For now, I would be happy to be able to compete with my classmates and that would be moderately tough, I guess. I think I will need at least six months’ practice and commitment to reach that level.\nI would like to learn to play table tennis primarily because it is a popular sport among my friends and classmates. As it requires extensive movements and physical exertions, it is also a good way of completing daily exercise which I need urgently as I am gaining some extra pounds. Finally, I would enjoy playing this sport for sure and I would love to become good at it."
    },
    {
      "url": "/speaking/part-2/describe-a-successful-business-that-you-know-about-you-should-say/",
      "content": "1. What business it is\n2. What this business does\n3. How you know about this business\n4. and explain why you think this business is successful.\nI’m not the kind of person who pays much attention to the business world, but there’s a company that has inspired me a lot in everything I do. That’s Apple – a giant tech company, the first trillion-dollar business and the most valuable brand in the world. They are renowned for producing the highest-quality technological devices, including smartphones, laptops, desktops, and headphones, among which the iPhone is considered a revolutionary product that changed the world with its release.\nThe first time I saw an iPhone, it completely blew me away, because it was unlike any other phone on the market at that time. Then I looked up the company behind the product, and was immediately intrigued by its fascinating success story.\nMany people probably don’t know this, but before becoming this successful, Apple struggled a lot and almost went bankrupt. Its first line of products was not welcomed by the public, and its infamous founder, Steve Jobs, was even fired from his own company. However, with the release of the original Macintosh and the iPhone, Apple managed to pull in lots of attention, and the sales of their products skyrocketed. Its success can be attributed to a few factors.\nFirst of all, it adapts very well to the demand of the market. From a first mover with lots of innovative devices, Apple now waits for a new technology to perfect itself before implementing it in their own products, offering their users not necessarily the first, but certainly the best experience. In this saturated market, no new technology can wow consumers, but an optimal experience can, and Apple is aiming for that.\nBesides, Apple is a marketing genius, coming up with brilliant catchphrases and creative campaigns to popularize their products. They also offer the best services in the tech world, overshadowing most of their competitors in this aspect.\nI don’t consider myself an Apple fanatic, but its business principles and practice have inspired me a lot, as I always try to provide my students with the best experience, and never give them any half-baked product or service. The company is definitely having a positive influence on me."
    },
    {
      "url": "/speaking/part-2/describe-a-time-when-you-spent-quality-time-with-your-favorite-person/",
      "content": "Well, one of my most memorable experiences of spending quality time with my favorite person was when I went on a hiking trip with my best friend, Sarah. It was during our summer break last year, and we both wanted to do something adventurous and reconnect with nature.\nWe decided to embark on a challenging trek to a picturesque mountain peak located a few hours away from our city. The journey started early in the morning as we set off with our backpacks filled with essentials like water, snacks, and a camera to capture the beautiful landscapes along the way.\nAs we hiked through the well-marked trails, Sarah and I had plenty of time to catch up on each other’s lives. We shared stories, dreams, and our aspirations for the future. It was amazing how the serene surroundings allowed us to have such deep conversations and strengthen our bond.\nThe hike itself was demanding, with steep slopes and rocky terrain, but we encouraged each other and provided constant support. Every time we reached a resting spot, we would sit together, admire the breathtaking views, and take pictures to capture the memories we were creating.\nAfter a few hours of hiking, we finally reached the summit. The panoramic view from the top was absolutely mesmerizing. We stood there in awe, feeling a sense of accomplishment and serenity. We shared a moment of silence, absorbing the beauty of nature and appreciating our friendship.\nWe spent the rest of the day at the peak, exploring the surroundings, taking more photos, and simply enjoying each other’s company. We laughed, joked, and even indulged in a small picnic we had prepared earlier. It was a perfect opportunity to relax, unwind, and escape the hustle and bustle of our daily lives.\nAs the sun began to set, we started our descent, cherishing the memories we had created together. Although we were physically exhausted, our spirits were high, and we couldn’t stop talking about the incredible adventure we had just experienced.\nOverall, that hiking trip with Sarah was an unforgettable experience. Not only did it allow us to spend quality time together, but it also strengthened our friendship. The combination of breathtaking scenery, challenging trails, and deep conversations created a unique bond that will always remain special to both of us."
    },
    {
      "url": "/speaking/part-2/describe-a-website-you-often-visit/",
      "content": "You should say:\n1. What type of website it is?\n2. How often you visit this website?\n3. What services or information it offers?\n4. and explain why you think this website is useful.\nThis is the age of technology. The Internet is one of the important aspects of technology and websites are the entrance to the vast virtual world. I have visited YouTube\nBasically, YouTube is a video sharing website and mostly the users upload different types of videos on this sharing website. This California based website, YouTube, is available across the world. The website visitors could share a good variety of videos, watch video songs, view movie trailers, dramas, serials and sometimes movies, educational videos and more other entertaining video clips for free of cost. They do not need to pay any charge for using the website. After its inception in 2005, the tech-giant Google bought it in 2006 with over 1.50 billion US dollars. The users are able to upload, share, comment, and rate the videos on the website. Currently, the website is also used for video blogging. Though many of the video clips are uploaded by private initiatives, many of the organisations also use this website for their video contents.\nI visit the website frequently in a day and in fact, there are no exact statistics of this visiting. There are no specific times or schedules to visit the site for me, and I think this is for anyone who is familiar with the website. I usually browse the website from my personal computer when I am at home. I use the official laptop when I need to visit during the office hours and sometimes use my cell phone to browse the site when I am on my way to somewhere. Basically, the website could be browsed from anywhere and I take the advantage. I use all the available platforms to browse the website and get my tasks done (mostly enjoying songs).\nYouTube offers a wide range of services and mostly those are related to videos. For instance, you sing very well but you do not have familiarity or audience. Okay. You may shoot a video with your cell phone camera and upload the video clip on YouTube. If the video does not violate the YouTube standard, the authority will publish the video on the website is perfect, it would be watched, enjoyed and shared by millions of people which will bring you fame. Besides, one can download the necessary and available videos if needed. All the videos on YouTube are free of cost and there are no hidden charges as well to enjoy the videos. It mostly gains profits from advertisements on the site. Since the number of visitors is more, the advertisers pay the YouTube authority to promote their respective products.\nThis is a very useful website for several reasons. The most important thing is the cost-free feature. We are in need of some information and videos in our everyday life and if we had to buy all the information, it would be impossible for us. But here we are having the information only by browsing the website. Besides, this is a unique platform to share and enjoy video clips. One can have almost all types of videos including entertaining or educative. People mostly use the website to enjoy the latest video songs, know about the latest movie trailers, pass their leisure hours by enjoying drama, movies, video songs etc. Most of the times, the video contents are useful to the viewers in many aspects and could be used for different purposes as well. Take a simple example. Someone has captured a real murder scene and has uploaded that on YouTube, consequently the video clip could be used as visual evidence against the murder and arrest the criminals."
    },
    {
      "url": "/speaking/part-2/describe-an-advertisement-that-persuaded-you-to-buy-a-product/",
      "content": "1. What advertisement it was\n2. Was it shown on TV, radio or newspaper\n3. What was good about that advertisement\n4. Explain why do you think that advertisement attracted you to buy the product\nSample Answer\nUndoubtedly, the advent of social media has given a duly kick to advertisers and promoters worldwide. These days, we can find ourselves surrounded by persuasive promotions on almost every channel, whether offline or online. In my opinion, I find TV advertisements to be more informative and gripping than the ones\nappearing on social media. Last week, I came across an ad on TV by Samsung wherein the brand was promoting their latest release – the Samsung Galaxy S22.\nIn the advertisement, a young lady seemingly was on a road trip with her friends where she used the Samsung Galaxy S22 to record her surroundings and click pictures of her friends. I found the concept enthralling; hence, I decided not to change the channel and watch it till the end.\nAlso, alongside the lady trying to capture everything, the brand had listed out the specifications and essential features of the phone. The beauty and elegant design of the phone were highlighted, which impressed me greatly. This advertisement pinpointed everything required to know to buy this phone, from the display size to the battery capacity.\nSince I was planning to upgrade my phone to a newer version, I was influenced by this commercial. Post the advertisement, I instantly searched for more features and pricing of the phone on the internet. I liked almost everything about it; thus, I ordered one myself.\nAll in all, I can state that the TV advertisements are influential, at least for me, as I ended up making this significant purchase merely because of a commercial."
    },
    {
      "url": "/speaking/part-2/describe-an-interesting-activity-that-you-enjoy-doing-on-weekends/",
      "content": "With the job, study and other responsibilities I have a busy schedule in my daily life and over the number of activities I had got limited. Yet, I maintain some of the activities I really enjoy. One such activity is hanging out with friends during my day-offs. We often meet at a place in the evening and enjoy our time. Sometimes we meet at a public place like a park or a field and sometimes we go to watch the theatre. I mostly do it with my close friends and we have 4-5 such friends who meet each other on our day-offs.\nI enjoy spending times with my friends as they are my long time friends and have a good understanding. I enjoy the topic we discuss or even the chit-chat we have in our conversation. As all of us got busy over time, we can’t meet very often and our meeting on our day-offs helps us maintaining our social gathering and friendship. We often plan to go to worth watching theatrical performance and movies and enjoy our time. This is indeed a good activity, at least to me, as I value their friendship and enjoy their company.\nGood friends are like treasures in life as I have often found their help in times of distress and need. Thus the activity I have allows me to spend some quality times, get their updates, discuss on topics that I learn things from and allow me doing some activities that otherwise would not have been possible."
    },
    {
      "url": "/speaking/part-2/describe-an-interesting-public-place-in-your-hometown/",
      "content": "One interesting public place in Uzbekistan is the Registan Square in the city of Samarkand. Registan Square is a magnificent architectural ensemble that represents the heart and soul of the city and showcases the rich history and cultural heritage of Uzbekistan.\nThe square is adorned with three grand madrasahs (Islamic schools) that stand as towering masterpieces of Islamic architecture. The first madrasah is Ulugh Beg Madrasah, built in the 15th century. It is characterized by its intricate mosaic work, detailed calligraphy, and mesmerizing geometric patterns. The second madrasah is Sher-Dor Madrasah, constructed in the 17th century, which features striking blue dome tiles and intricate animal motifs, a rare sight in Islamic architecture. The third madrasah is Tilya-Kori Madrasah, completed in the 17th century, and it impresses with its ornate gold decorations and exquisite artwork.\nThe grandeur of the madrasahs is further enhanced by the open courtyard of the square, which is paved with beautiful tiles and surrounded by arched passageways. The combination of the architectural masterpieces and the spacious square creates a sense of awe and reverence.\nRegistan Square has served as a public gathering place for centuries. It was not only a center for religious education but also a venue for public events, ceremonies, and markets. Today, the square continues to be a bustling hub of activity, attracting both locals and tourists alike.\nVisiting Registan Square offers a unique opportunity to immerse oneself in the history and culture of Uzbekistan. The intricate details of the architecture, the vibrant colors of the mosaics, and the serene atmosphere make it a captivating destination. Exploring the madrasahs allows visitors to appreciate the craftsmanship and artistic skills of the artisans who created these architectural wonders.\nMoreover, the square often serves as a venue for cultural festivals, music performances, and traditional ceremonies, providing visitors with an opportunity to experience the living culture of Uzbekistan firsthand. The sounds of traditional music, the aroma of local cuisine, and the vibrant energy of the crowd create a lively and memorable atmosphere.\nRegistan Square is not only a feast for the eyes but also a place of historical significance. It stands as a testament to the glory and grandeur of the ancient Silk Road, which passed through Samarkand, connecting civilizations and fostering cultural exchange.\nRegistan Square in Samarkand, Uzbekistan, is a captivating and historically significant public place. The majestic madrasahs, the spacious courtyard, and the rich cultural activities make it an interesting destination for anyone seeking to explore the architectural beauty, history, and vibrant culture of Uzbekistan."
    },
    {
      "url": "/speaking/part-2/describe-your-favorite-unusual-animal/",
      "content": "You should say: \n\n\nwhat animal it is\n\n\nwhere you saw it\n\n\nwhat it looks like\n\n\nand explain why you think it is an interesting animal.\nAnimals are one of the most fascinating and diverse creations of nature. There are so many different types of animals that exist on our planet. Among them, the animal which I find the most interesting is the “chameleon”. For this topic, I would like to talk about this animal that I personally find so fascinating and interesting. The chameleon is a type of lizard that is known for its ability to change colour. This unique ability of the chameleon has always amazed me.\nI first saw a chameleon at the zoo in my hometown. It was a small green and brown chameleon that was sitting on a branch. The chameleon was trying to blend in with the branch by changing its colour to match the surroundings. Later, I have seen this interesting creature a few times in different places including at a friend’s house.\nChameleons have a distinctive appearance. They have a long and slender body with a small head and eyes that move independently. Their feet are specially adapted for climbing and grasping. Chameleons have a long, sticky tongue that they use to catch insects.\nAnother interesting fact about chameleons is that they have the ability to move their eyes independently. This allows them to look in two different directions at the same time. This is particularly useful when hunting for prey or trying to avoid predators"
    },
    {
      "url": "/speaking/part-2/describe-your-favourite-movie-film/",
      "content": "You should say:\n1. What it is?\n2. When you watched it?\n3. What it is about?\n4. and explain why this is your favourite movie.\nI usually pass my leisure hours by participating in sports but recently I have started watching movies at home. Last month, I watched a movie named Life is Beautiful and now this has become my favourite one. This is one of the special movies that I have ever seen.\nThe movie belongs to comedy-drama genre. It comes with different issues during the holocaust. Besides, the movie plot is outstanding and the performance of the characters are splendid. The movie was made in 1997 and was directed by Roberto Benigni. He also was the lead actor in the movie. Moreover, he also co-wrote the movie. The plot of this movie reminds people of the Second World War when the Nazi concentration camps were used to punish the opposition and the ordinary people. The movie also demonstrates the love of a father to his son and how he protects the son from dangers inside the concentration camp.\nUsually, I take part in sport in the evening hours. But during the holidays, I spent my times at the home. And when I am at home, I watch movies or listen to music. This time, instead of listening music, I watched the movie. I was accompanied by my family members. In fact, my mother loves to watch movies and I developed the habit from her. She loves to watch drama movies and in line with her interest, I also grew a taste for drama movies. Actually, when I am inside the movie, it is hard indeed to detach me from the watching. The similar thing happened with this one. This is the movie, that comes with some comical and dramatic elements. So, I enjoyed the movie until the last moment. I started watching the movie at around 4.00 pm and finished it after nearly two hours. I was glued to the screen by this time and gained a different experience.\nThe movie is about a couple of things. It appeared to me that the movie has been made to make the viewers aware of the detrimental impacts of the holocaust -how the event destroyed families and people. On the other side, the movie is about the affection of a father to his son. The eternal love of the father to his son is demonstrated here. An ordinary Jewish father sacrifices his life to save his son from the Nazi occupation during the World War II. The father is taken to the concentration camp with his son. After reaching the camp, he meets with many other people. He also meets with his wife. Unluckily the meeting was short. But he uses his extraordinary imaginations to save the son from the Nazi forces. And finally, he becomes successful in protecting the son in exchange for his life.\nThis is my favourite movie for many reasons. This is one of the movies that has won several prestigious awards. The movie plot is outstanding while the movie making was excellent. The movie plot is the key attraction here. An open-minded Jewish man is held without any charge and sent to the concentration camp. Finally, he lost his life – a soldier shot him before leaving the camp during the invasion by the allied forces. But he saved his son. He developed a story and played the role of a character in the story to let his son know that the events were a game. The events turned tragic finally. Life was beautiful to his son and wife. He could not taste the liberty. Considering the inner issues, I love this movie."
    },
    {
      "url": "/speaking/part-2/describe-your-favourite-restaurant/",
      "content": "You should say:\n1. Where it is located?\n2. What the restaurant looks like?\n3. What kinds of foods and beverages it offers?\n4. and explain what makes this restaurant so special to you.\nMistral is a restaurant located in Ibn Battuta Gate in Dubai and this is one of the finest places for dining in the country. The restaurant is located on the side of a busy marketplace and always is crowded by the visitors from home and abroad. The restaurant staffs are welcoming all the visitors and guests cordially. The entire atmosphere is filled with the smells of spices which are alluring for all. People could have their breakfast, lunch, brunch or dinner and the meals are prepared with the local cuisine of Arabia. Besides, the restaurant also allows the visitors to taste the fresh foods from the seafood fare.\nThe restaurant looks like a mini marketplace beside a large market for its crowd inside the big place. The place inside is a bit dark yet, the restaurant is preferred by almost all types of visitors here only for the delicious foods and drinks. The seating arrangements are admirable while the serving techniques are also praiseworthy. Amid the crowd, the visitors do not feel alienated rather all of them enjoy their respective meals and drinks. This is a very good place for dining with family members and taste the traditional tastes of Arabia. The restaurant offers different types of foods and drinks to the visitors like the sumptuous breakfast buffet, lunch buffet centring Arabic cuisine, hot and cold Arabic mezzeh, seafood buffet for dinner etc. Besides, there are plenty of entertainment areas for the kids during the stay at the restaurant.\nThe foods and drinks at the restaurant are up to the mark and satisfactory. The serving quality is splendid. The restaurant serves the clients with different sorts of local and traditional foods in line with seafood. Besides, there are different sorts of drinks are also available here. The all-day dining station is filled with extraordinary foods and fruits. The seafood collection is adorable while the meats are cooked very well that they almost melt in the mouth. The desserts made in the restaurant is considered as the best one in the country. Moreover, the children section is also wonderful and enriched with attractive toys and attentive staff. The visitors can order their foods after a great variety of foods and they need to wait for few moments for the food to be prepared.\nThis is a special restaurant to me for some special reasons. I like the seafood and drinks here most and they are really praiseworthy. Often I take my buffet seafood dinner here and the price is also reasonable for me. When I am with my kids, I allow them to play inside the children’s room and I do not need to worry about them at all."
    },
    {
      "url": "/speaking/part-2/describe-your-favourite-room-at-your-home/",
      "content": "what the room is\n\n\nWhich is your favourite room in the house?\n\n\nWhy do you regard it as your favourite?\n\n\nWhat changes do you want to make it?\n\n\nWell, rooms are an integral part of our life, and most individuals spend their quality time in the house along with family members. I think it could be a most crucial part for everyone and here I would like to talk about a room which is my favourite and interesting due to an abundance of reasons first of all my favourite room is my own living room because this room is already decorated with precious elements according to modern style. I also remember that time, while manufacturing the whole house, I gave a piece of advice about using Italian marble for my house because I wanted to decorate that house with my own taste and texture. Apart from that ambience of the inside room is quite mesmerising because I always spend my quality time with family members every evening. We also do a lot of extracurricular activities in this room, and one of the things my favourite is the walls of the living room is a marvel because the colour of a wall painted blue-collar along with premium wallpapers always gives a kind electrifying experience whenever he curtains of this living room is specially designed by a Japanese designer that is my favourite part and and and every time my friends and guest alike to visit my house mt first preference to show that room which I found marvellous and feel proud when they stalk the whole the rooms with the naked eye. Furthermore, it looks like a five-star hotel room with all crucial amenities. Whereas. The furniture used in the living room is quite expensive and imported, and when I feel more stressed, I would like to spend that time in this room, and I charged up it a few times some time; I often listen to songs on 55INCH led connected with home theatre. Last but not least every evening we also have a cup of coffee and watch the TV and also make some jokes. I feel overwhelmed and on cloud 9 when I visit this room in the day to day life."
    },
    {
      "url": "/speaking/part-2/talk-about-a-painting-you-would-like-to-have-in-your-home-you-should-say/",
      "content": "1. What is it?\n2. How you know about it?\n3. How much it would cost you?\n4. and explain why you want to have it in your home.\n”The Creation of Adam” painted by Michelangelo is the painting that I would like to have in my house. It is a painting that forms the part of the Sistine Chapel Ceiling, and it illustrates the Biblical creation narration of humans from the book of Genesis. This picture depicts the creation of “human” where God breathes life into Adam. This is considered to be one of the finest works ever done by a painter and only rivalled by two other great paintings: Mona Lisa and The Last Supper. I saw a picture of this painting in our history book when I was in high school, and I was amazed by the painting and the idea of the painting. I am sure this painting is priceless, and no individual would be able to own it and hang it in his/her house. But I can buy a copied version of this painting which would cost me around $40. When I looked at the painting in my early childhood, I was enthralled by the idea and fine work of this painting. This painting inspired me to learn more about painting and the greatest work of mythological paintings. Later I learned about other great paintings by Michelangelo and by other greatest artists. Furthermore, every time I look at this picture, I feel the overwhelming joy of creation, the human race and divinity. Because of this, I would like to have this picture (more accurately the copy of the original one) in my home."
    }
  ]