[
    {
      "url": "/speaking/part-3/advertisement/",
      "content": "1. Do you think advertising influences what people buy?\n2. Is advertising really necessary in modern society?\n2. Is there any advertising that can be harmful to children?\n\nDo you think advertising influences what people buy?\nYes, definitely. If there were no advertising and you went to a shop, then you would just buy what you wanted based on maybe what others have told you, what the product looks like, or, depending on the product, what it says on the label. Advertising builds up a brand and people then trust a certain thing because they have seen it on television or elsewhere.\n\nAlso, there is so much advertising around it must influence us. You can’t escape it as it is fed to us constantly in our daily lives – not only in magazines, radio and television, but on billboards, on TVs installed on trains and platforms, even in schools and universities. So yes, advertising influences what we buy.\n\n\nIs advertising really necessary in modern society?\nIt could be seen to be necessary in terms of the fact that, as I mentioned before, there is so much choice that we need someone to guide us in what to buy or to give us some extra information about products. Without this, it would be difficult to know where to start. However, that said, I’m not sure that I would regard it as ‘necessary’ as overall I think it may do more harm than good. As we just discussed, advertising encourages people to buy things they possibly do not need. We live in a consumer society and many people are in debt because we are encouraged to buy and buy, and I’m sure advertising plays a major role in this. Without advertising we could just do our own research and decide what we really need. So no, I would not say that advertising in necessary in modern society\n\n\nHow does advertising influence children? Good answer starters: ●children are an extremely vulnerable target audience How ads influence children:\n●commercials make children pester their parents for junk food, expensive toys and modern gadgets\n●children make excessive demands on their parents for the products they see in the ads, especially if they were advertised ●by their favourite characters\n●some children even have tantrums in public if their parents refuse to buy products the see in ads\n●children often imitate specific behaviours they see in ads\n●advertising affects kids’ well-being\n●advertising leads children to choose junk food instead of healthy options\n●advertising causes changes in children’s behaviour. Why this happens:\n●children take everything at face value and therefore they are easy to persuade\n●children are cognitively and psychologically defenceless against advertising\n●children are not able to understand persuasive character of advertising messages."
    },
    {
      "url": "/speaking/part-3/art/",
      "content": "1. How do people in your country feel about art?\nAnswer: We, humans, are “unique” in our existence and experience. Therefore, it is only natural that we have our needs and expectation that are unique as well. But among those unique needs and expectation, that separates us from animals, enjoying art seems to be something that makes us “truly” unique as humans. So, what is the general purpose of art? Well, the answer is, art helps us to look at ourselves little “closer” in a different light by explaining our desire and expectation in more details which otherwise wouldn’t be possible. With the help of art, we are able to communicate our social, political, cultural and spiritual ideas in a much more organized manner so that we feel “challenged” to rethink over the issues and the subjects that are affecting us and our surroundings on a daily basis. We enjoy art because it stimulates our hearts and minds to appreciate our lives in a more positive light. We enjoy art also because it makes us feel “different” by combining our “unusual motifs” that weave their way into our “subconscious” (or the “hidden” us) and alter our mood so that we feel free to travel into a different\nrealm.\n2. How has art changed in the past few decades in your country?\nAnswer: I am no art expert, but as far as I can understand, art has certainly changed in the last few decades in my country. For example, before a few decades, any artwork, be it a drama performance, film, or painting work, used to be “original” and “thought-provoking”. But these days, most artworks are void of any particular “message” or sometimes bear complex meanings which could possibly reflect our society and lifestyle in general. Besides, before a few decades ago, artists were reluctant to stay close to “power and establishment”, but these days, their artworks act as some kind of “mouthpiece” of the “establishment” most of the times. Finally, in the past, artworks mostly reflected our own culture and tradition but they are more “universal” in these days.\n3. Do you think children should study art in school?\nAnswer: Art is like food for the soul, and that’s why children can benefit a lot from learning at school. To start with, through learning art children can draw their “creativities” out in the light by painting some interesting art pieces or by acting in a certain way in drama class. Learning art may also increase patience and determination in children because it takes a long time and efforts to learn and understand this subject. Finally, it also promotes teamwork and problem-solving skills as the children learn to collaborate and compete with each other in order to do well in art classes."
    },
    {
      "url": "/speaking/part-3/books/",
      "content": "1. Do people read more nowadays?\nI think that’s tough to say, but all in all I would guess that people today read less than people in the past did. Take someone like my mom for example. In the past, she was a very avid reader, and would finish at least a few books every week. These days, she still reads occasionally, but with all of the great TV shows available to stream instantly, she actually spends a lot more time watching TV. So, I think people today read less because of the wide availability of other sources of entertainment, like TV\n2. Let’s move on to the topic of traditional literature in your country. What is one example of traditional literature in your country?\nWell, there are many kinds of traditional literature that were originally written in several different languages. One famous example I can think of is an epic poem which was written over two thousand years ago called the Ramayana. The poem was written in Sanskrit, and it describes the life of a god named Rama. Do you like reading the traditional literature of your country?\n3. Do you like reading the traditional literature of your country?\nYes, I love it. Reading traditional literature brings me closer to the country that I live in and it is very enjoyable. Because, when you read literature from a particular country, you get to know more about its culture and it is truly my dream to explore my country and understand it more deeply."
    },
    {
      "url": "/speaking/part-3/business/",
      "content": "1. What do you think is the retirement age for men and women?\nIt is my opinion that there should be no restriction regarding the age to which men and women can work. As long as their health allows and their company requires their services, they can keep on contributing, and retire only when they feel that they have reached their limit. Old employees’ experience and wisdom can be extremely valuable, and I think it is a huge loss when they are forced to retire while they are still physically and mentally capable.\n2. What kinds of qualities do people need to run their own business?\nThere are a few factors that come into play, but at the top of the list, I think a business owner must be extremely well-organized. Running a business is no simple feat, and if an entrepreneur can’t plan things well and manage the many different aspects of a company, the situation will be very chaotic. In addition, those who want to be their own boss should have a clear vision, because no business can thrive without its identity figured out and a well-thought-out development plan.\n3. What do you think are the key factors that contribute to the success of a business?\nI personally think that, more than anything, a company must have a competitive advantage in order to become successful. In other words, they should gain an edge over their competitors in a particular aspect, be it price, user experience or uniqueness.\nBesides, a strong team can be a major contributor to the success of a business. A good smartphone, for example, may not sell if there isn’t a strong marketing team to bring it to the public eye and a capable sales team to convince its customers to make a purchase."
    },
    {
      "url": "/speaking/part-3/change/",
      "content": "1. Do you think change is good?\nYes, and my hometown developed significantly in the last twenty years.It became industrialized, which I think is beneficial to us residents and to our local economy since jobs have been generated.However it is the saddest thing about its development is that it brings so much pollution.I think we are paying the price for converting our agricultural lands to industrial ones.\n2. Why do old people not accept change?\nNowadays, it’s probably not a question of age, it depends more on the individual person. Older people are still very adaptable and although they might not be interested in some of the things that younger are crazy about or use, they still have the ability to adopt new ideas and ways of doing things. My father, for example, grew up without the internet but through his work and because he’s interested in what technology can achieve he probably knows more about it than I do and is therefore always ready to try the next new thing – which interest him – not necessarily me. Being adaptable is very much a personal trait, not so much age related. I even know some young people who don’t like change much.\n3. In what ways have changes in technology changed people’s lives?\nTechnology pretty much has changed each and every aspect of our lives, but perhaps it is safe to say that it has changed the way we communicate with each other the most with the advent of the internet, mobile phones and smart gadgets. Technology has indeed proved the age-old saying “talk is cheap”- so cheap that we talk to each other by using our phones pretty much always, whether we are staying close to each other or far apart, even when we don’t need it. We have also become lazy to walk even 100 feet or a few minutes these days if we are in need to communicate something to our friends or families since we can do the same in seconds just by pushing a button on our phones. But, if we are not in a mood or feel really lazy to “talk” sometimes, we simply leave or send a message on social media networks and “messenger” to inform others about our “status”. Finally, technology has made communication really “personal” as we can see each other on live video while communicating, no matter where we live with the use of the internet."
    },
    {
      "url": "/speaking/part-3/childhood/",
      "content": "1. Is it important to have pleasant childhood memories? Why?\nAnswer: It is absolutely important to have pleasant childhood memories because, without them, negativity will creep up into our lives when we grow up to become adults. In fact, without pleasant childhood memories, we would develop mistrust, sense of unnecessary shame, doubt and guilt, sense of inferiority, confusion with playing a proper social role in the community in our lives while most likely remaining isolated also from the fun and productive activities. Childhood memories often make or break our future life and that is why it is imperative to have a pleasant childhood and positive memories associated with it.\n2. Do you think that people are permanently affected by negative childhood memories? Why do you think so?\nAnswer: Negative childhood memories have some impacts on our future like but I don’t think that people are permanently affected by negative childhood memories just as they aren’t by the positive memories because if they did affect, it would be very difficult for us to make decisions quickly, and we would always carry a huge load of the complex emotional bag on our back to be “functional”. Besides, the fact, that we are able to treat some of our mental illnesses (which are essentially nothing but a collection of negative memories from our past childhood sometimes) with “psychiatric” treatments, proves to us that people aren’t affected by childhood memories permanently. If we were enduringly affected by our negative experiences in childhood, it would have been quite impossible for us to carry on as adults.\n3. What do you think it means to ‘live in the past’?\nAnswer: “Memories” are lifetime things that remain with us for the rest of our lives, and when we think and talk about these memories by forgetting about the normal activities of our lives, we call it “living in the past”. Of course, “living in the past” is not that bad when cling on to the “pleasant” memories because they sometimes motivate us to have positive views about life, but if we cling on to the “unpleasant or negative” memories most of the time, we become depressed and find it really hard to enjoy the “normal” things in our lives.\n4. Nowadays many parents try to make their children happy by buying them many toys. How do you feel about this?\nAnswer: Generally speaking, it makes me feel good when I see that parents are buying their children many toys in order to make them happy because it helps create “good memories” in the minds of the children. Besides, the practice also helps create a stronger bond between the parents and their children. However, while the practice of buying many toys may seem to be an “innocent” act in isolation, parents would do good on their parts if they also care to teach their children sometimes not to get “mad or unhappy”, when they (the children) don’t receive something they really like, in order to help children understand the “realities” of life.\n5. Is it important for a child to have a lot of toys in order to be happy?\nAnswer: No, it is not important for a child to have a “lot” (because this is the “keyword” here) of toys in order to become happy as long as they are taught what it really means to be “happy”. If the children are taught that the “real happiness” lies in celebrating life and many of its occasions without receiving any “material” things in return, then the chances are that they wouldn’t exactly dig too much into the idea of receiving a “lot” of gifts to become happy. Besides, children are “innocent” minded, so if they are treated with genuine love and care, they wouldn’t really mind too much about the “number” of toys they are getting.\n6. What is more important for a child’s happiness, many toys or many friends?\nAnswer: A child needs both the toys and friends to become happy in his or her life, but they certainly don’t need “many” of either of them. Contrary to popular belief, I really like to think that children are “rational”, and they don’t exactly care to understand the complicated issue of “being happy”. Rather, all the children care is to “enjoy and have fun” in their lives whether they get them from playing with their friends or by playing with their toys."
    },
    {
      "url": "/speaking/part-3/city/",
      "content": "1. Where do people like to live in your country?\nWell, although residential choices obviously vary with personal preferences, I would say, from my observation, that urban dwellers make up the majority of my country’s population. And I think that’s because of the rich variety of job opportunities there.\n2. Why do many people move to the city?\nAs mentioned previously, career chances is the uppermost reason, without a doubt. Aside from that, the availability and quality of education and healthcare services are other key factors. Also, those who want amenities within reach wouldn’t even give a second thought, I believe.\n3. What are the advantages of living close to the workplace?\nWell, the benefits are substantial. First of all, it significantly saves workers’ commuting time and expenditures on fuel. And as a result, the money and time saved could be allocated to their other concerns. Second, in many urgent cases when people need to show up quick at their company, it wouldn’t be an issue.\n4. What kind of place do older people prefer to live in?\nWell, again, it’s a matter of personal preferences, I think. If they want to live close to their young who usually settle in the city, they will probably opt for the place. On the other hand, the tranquil surroundings and the slow-paced lifestyle of the countryside would be more agreeable to those who have slowed down in their senior years. Furthermore, community ties are often higher there, so it’s easier for the elderly to receive emotional and social support from people around."
    },
    {
      "url": "/speaking/part-3/restaurants/",
      "content": "1. Why do you think people go to restaurants when they want to celebrate something?\n2. Which are more popular in your country: fast food restaurants or traditional restaurants?\n3. Why do you think that is?\n4. Some people say that food in an expensive restaurant is always better than food in a cheap restaurant – would you agree?\n5. Do you think there will be a greater choice of food available in shops in the future, or will there be less choice?\n6. What effects has modern technology had on the way food is produced?\n7. How important is it for a country to be able to grow all the food it needs, without importing any from other countries?\n1. Why do you think people go to restaurants when they want to celebrate something?\nAnswer: In my opinion, restaurants probably are one of the most popular public places, where all kinds of people can visit with the most ease. And it is probably this high level of “ease”, and the absence of an “uncomfortable feeling” for many of being stuck in a private place, that makes restaurants a perfect place to celebrate a special occasion or event. Besides, it is just not always possible to accommodate and serve so many guests together in a private place, like a home or office, because of the lack of logistic support and other things, which is usually not the case with restaurants. Finally, people often want to indulge themselves with the menus that are served at a restaurant to satisfy their taste buds and decide to celebrate an event at a restaurant.\n2. Which are more popular in your country: fast food restaurants or traditional restaurants? Why do you think that is?\nAnswer: There is no doubt that fastfood restaurants are gaining huge popularity steadily, but traditional restaurants are still, by far, the more popular food outlet of the two in our country. There could be a number of reasons that attribute to the popularity of the traditional restaurants, but I will just mention two of those reasons here: the first reason, of course, traditional foods, more often than not, are generally more healthy and tasty. The second reason is that the traditional foods, surprisingly in many cases, are cheaper than that of the fastfood restaurants.\n3. Some people say that food in an expensive restaurant is always better than food in a cheap restaurant – would you agree?\nAnswer: If the word “better” in the question here means that the foods at an expensive restaurant are always delicious and healthy, then I will just have to disagree with the substance of this question. After all, the quality of foods, be it served at an expensive restaurant or a cheap one, doesn’t depend on how much exactly is charged for the foods, but on how fresh or good the raw materials really are, and how they are cooked or prepared on a given day. From my experince, I can say that, several times, I have tasted far better food in a moderate restaurant while I could not enjoy my food in a highly expensive restaurant.\n4. Do you think there will be a greater choice of food available in shops in the future, or will there be less choice?\nAnswer: Well, I do think that markets and shops will serve a greater choice of foods in the future as the taste and preferences of people always keep changing, not only with regard to the foods, but also with many other things. Besides, foods are something which we have to have on a regular basis to survive, and sometimes, it just may not always be possible to grow or have the same kinds of foods or food grains because of the changes in the weather system or market trends. And so, it is only natural that people will try to find different types of foods to meet their demands. Finally, global trade agreements and technological development will make it possible to import foods, fruits, and grains from all around the world, giving consumers a much wider choice.\n5. What effects has modern technology had on the way food is produced?\nAnswer: Well, for better or worse, technology has changed the way we live and produce the things that we may need. In fact, it is because of the food engineering technologies today, like genetic modification of foods, that we have managed to produce a rather large quantity of foods within a short period of time. Besides, by using these modern technologies, things like food preservation, processing, packaging and distribution have always become relatively easy and effective as far as the issue of using safe foods is concerned.\n6. How important is it for a country to be able to grow all the food it needs, without importing any from other countries?\nAnswer: It is very important that a country is able to grow all the foods without importing anything from other countries because it would ensure some kind of food security for its own citizens. Besides, such schemes would also help a country gain even more financially and economically by opening doors to more economic activities and creating better job opportunities for its own citizens. Finally, it will also stop a country from falling victim to more powerful nations – powerful nations who might use the supply of foods as a “weapon” - at a time of international conflict. However, practically speaking, it is not feasible for most countries in the world to grow and produce all the fooods they need, which means importing foods and grains will always be an important aspect."
    }
  ]