[
    {
      "url": "/speaking/part-1/ads-2/",
      "content": "1.Are there many advertisements in your country?\nYes, there are. We are surrounded by advertisements, which occupy a lot of space in our life. I am feed up with the advertising messages sent to my cell-phones, which inform me of the sales of houses by estate agency, sales of clothes in a certain mall, and so on.\n2.Why do you think there are so many advertisements now?\nFor one thing, the competition is severe among manufacturers and companies who offer the same type of product or service. By investing in advertisement, they are better known to the public, so as to achieve high sales. For another, the various ways of advertising available makes it possible for them to publicize their product or service.\n3.What are the various places where we see advertisements?\nWe can see advertisements everywhere. They are printed on newspapers and magazines, painted on the wall of various buildings and on the buses running around the city, broadcasted on TVs and radios. Moreover, they are sent to us through our cell-phones and we are exposed to advertisements when we surf on the internet.\n4.How do you feel about advertisements?\nI dislike advertisements. Advertisements do offer us useful information, but most of them are to promote stuff for people to consume. I hope more space, no matter that on newspapers or walls on the buildings, be used to publicize public service advertising, advocating people to have a healthier life.\n5.What kinds of advertisements you like the most?\nI like advertisements of publicizing kinds of activities, such as concerts given by singers, promotion of a well-known brand with a celebrity coming to the opening ceremony, or charity program. I appreciate the opportunities to see in person my favourite musicians and actors coming to take part in the activities.\n6.Do advertisements (ever) influence your choice about what to buy?\nYes, they do, to some extent. There are times when I waste money on things I don’t need on sales, which I know from advertisements. Advertisements, however, offer me information of various brands of what I need. I tend to buy things advertised most, though I know I am charged more as the expense of advertising is added to the cost of goods.\n7.Do you like advertisements on TV?\nNo, I don’t like that. I am tired of wasting my time on advertisements broadcasted before or during the program I want to see. That’s why I prefer to watch programs on the internet, where the amount of advertisements is less.\n8.Do you prefer advertisements on TV or those in magazines?\nI prefer advertisements on TV, which are more vivid than those in magazines. TV advertising makes full use of language, sound, words, images, action and performance, etc, to entertain people. Besides, they take up diverse forms of expression, such as telling a story to move audience, inviting a celebrity to participate, or making up a funny cartoon, by computer technology, to amuse audience, all of which leave a deeper impression on the audience.\n9.What do you think is the purpose of advertisements (or advertising)?\nAs the name suggests, advertisement is a public promotion of some product or service. Advertisements are mostly used by manufacturers and companies to make their product or the service they offer known to people, which is an effective means of publicity.\n10.Do you think advertising play a very important role in today’s world?\nYes, it does. Besides promoting product of service, advertising provides people a wide collection of news. For example, there are various activities held in Hangzhou every year, like the China International Animation Festival, which are on broadcast months ago before their opening date, to inform people of relevant information.\n11.What sorts of advertisements leave the deepest impression on people?\nThe public service advertising impresses me most. As we know, smoking does great harm to people’s health, and more people suffer form passive smoking. A public service advertising aims at this is on broadcast. A smoking man appears, followed by a woman and a child who cough badly and then fall down. It is exaggerative but does well in warning people of the danger."
    },
    {
      "url": "/speaking/part-1/ads/",
      "content": "1.Do you like watching advertisements?\nDepends on the ad. If it’s well-made and catchy then I’d give it a shot.\n2.Will you buy something because of an advertisement?\nIt could trigger me to an extent, but I won’t buy anything just because I saw it on the ads.\n3.Do you like funny or serious advertisements?\nAgain, it depends on the quality. I do not care about the overall mood of the ad, the first thing I pay attention to is production quality and style."
    },
    {
      "url": "/speaking/part-1/animals-and-wildlife/",
      "content": "Do you like wild animals?\n\nYes. I would not probably like encountering with them, but I like to watch them from safe distance.\n\nWhat is your favourite wild animal? Why?\n\nIt’s honey badger. This animal does not know or does not have the word fear in its vocabulary. It’s really nasty, eager and no one likes it in animal kingdom to a degree that even lions do not mess with them.\n\nHave you ever seen animals in the wild?\n\nNo, my hometown is founded in a desert, so the wildest what ive seen so far is a pack of stray dogs in my neighborhood."
    },
    {
      "url": "/speaking/part-1/apps/",
      "content": "What kinds of apps do you often use?\n\nI mostly use mix of built-in and side apps on my phone. These are music players like the phone my phone has and Spotify as well as some social media apps and native email app.\n\nIs there any apps you would like to download?\n\nI don’t think so. I have all the apps that I need on my phone, so I am good.\n\nWhat’s the most popular app in your country?\n\nAccording to an online survey results, the number one app in Uzbekistan is Telegram which is a free, cross platform messenger used for work, business and other purposes."
    },
    {
      "url": "/speaking/part-1/art-2/",
      "content": "Do you like art?\n\nAs an artistically inclined person, I can say yes. I love art in general, specifically I have a strong liking for music.\n\nDo you think art classes are necessary? Why?\n\nI believe so. Art classes foster creativity and allows young minds to learn to express themselves via different art disciplines.\n\nHow often do you visit art galleries?\n\nIt’s a pity we don’t have one in my hometown. However, there are virtual excursions for people like me and I enjoy them from time to time."
    },
    {
      "url": "/speaking/part-1/art/",
      "content": "Do you like modern art or traditional art?\nAs an artistic nature, I appreciate both. Traditional art is an all-time classic, serving both as a foundation base for any further development in art and as a reference point for any artistic experiments, which are in turn the core of modern art. The latter can not exist without the former as they are interrelated, so I’d say I like both classic portraits and an art-house installation at the same time.\nDo you like art?\nI’m in love with art, specifically music. The idea of manipulating soundwaves and frequencies to create eloquence, beauty, and harmony as well as to manifest and tell a story simply leaves me in awe.\nDo you think it would be interesting for you to be an artist?\nI do produce some music of my own. Mostly it’s electronic music, as you only need a laptop and a pair of decent headphones for that. Nothing serious for now, but I am looking forward to releasing some singles and albums and making a name for myself in the industry.\nIs there any artwork on the wall in your room?\nI like my walls plain, but I have this baroque style wallpapers on them, so technically, there are some colorful patterns on my wall.\nHave you ever visited an art gallery?\nI’ve been to a local museum, a youth center, and an art gallery here in my hometown and saw all the installations and saw all the installations and exhibits there. While it was entertaining, there was nothing that would have made me think for a long time."
    },
    {
      "url": "/speaking/part-1/bags/",
      "content": "Is a bag an ideal gift?\nHighly doubt it. It could be supposing it’s an LV, Gucci, Prada, or any other major brand bag. But then again, there’s no accounting for taste.\nDo you often change your bags?\nNo. I usually pick up one, carry it around until it’s worn out, and then buy the substitute. For me, if I have one durable and comfy backpack, that’s enough for like until it gets expired.\nDo you like bags? What type of bags do you like?\nI’m really into backpacks and waist bags. Depending on the amount of stuff that I usually carry around, I usually end up between these two.\nDo you have different bags for different occasions?\nNo. My rucksack is universal, and as a man, I don’t see any practical point in having multiple bags for different occasions. Besides I don’t go out that much, so there’s no real need either.\nDo you usually carry a bag when you go out?\nNo, I usually prefer going out hands-free. Everything that I need including my phone and keys goes into my pockets, hopefully, they’re deep enough to store all of it.\nWhat do you put in your bag?\nUsually, these are my laptop, my journal, a pen or two, wet napkins just in case, a case of my glasses if I’m wearing a pair, my headphones, and a charger for my laptop and I’m good to go.\nWhen you are buying a bag, what factors do you consider?\nNot so many things actually. Firstly, whether it’s a brand stuff or not because despite the price brand bags do last for a long time, like my Vans backpack. Secondly, how many sections it has, here the more the merrier. Lastly, I check out if it is good to carry around and if it will be still good if fully loaded."
    },
    {
      "url": "/speaking/part-1/bicycles-2/",
      "content": "Do you like riding a bicycle?\nI love cycling! Ever since I sat down to the seat at the age of 7, I have been doing nothing but getting a deep sense of pleasure whenever I go out for a ride.\nHow often do you ride it?\nI used to have a bike but now I don’t. Luckily, we have a bike rental at the park, so I can go riding when I have some free time and when I feel like to.\nWhen do you think is the best time to ride a bicycle?\nIt seems to me morning is the best time for a ride, at least from my perspective. It can be a good workout for an upcoming day and charges you with positive vibes throughout the day."
    },
    {
      "url": "/speaking/part-1/books/",
      "content": "1.Do you like reading books?\nI am not much of a reader, but I like to read from time to time. Usually it’s non-fiction and I am super picky about what I want to read.\n2.How often do you read?\nEvery once in a while, when I feel like to. Usually I do something else instead of reading.\n3.Do you have many books at home?\nOh yes, I have a huge collection of Russian and world literature. I haven’t read all of them, but I know the main plot of each and every book."
    },
    {
      "url": "/speaking/part-1/buildings/",
      "content": "Where do you live?\n\nI live in one-bedroom apartment on the 3rd floor of the apartment block in the central neighborhood in my hometown. The accommodation here is considered one of the best in the entire city, so I am lucky on this.\n\nWhat building is considered famous in your town?\n\nThere’s this department store called ‘New life’ at the central market in Navoi. It’s a white 5 story building with somewhat catchy and unique design. They incorporated a lot of white color and glass to make it look modern.\n\nWhat types of buildings are there in your living area?\n\nSince Navoi is a young growing city, we can some examples of Soviet architechture as well modern buildings at the same place. I think it’s really good to see them in one place as this allows you to visually see the differences in generations as well as demands and techniques used in architecture in different periods of time."
    },
    {
      "url": "/speaking/part-1/cakes-and-desserts/",
      "content": "Do you like eating cakes?\n\nNot as much as I liked it ago. I mean, there is nothing wrong with having them every once in a while, on special occasions, however, I don’t really think they do any good if eaten more frequently.\n\nDid you like cakes or desserts when you were a child?\n\nAs any other child out there, I also like cakes because they are so festive and do not look like anything else you usually get from the store. There was something special about them which got me captivated by them.\n\nDo you know how to bake cakes?\n\nNo, I am not into baking cakes. It’s a rather difficult process and I think not everyone can do it not to mention making a living on it."
    },
    {
      "url": "/speaking/part-1/cinema/",
      "content": "1.How often do you go to the cinema?\nI do’nt go at all. I prefer watching movies at home, on my laptop.\n2.Are cinema tickets expensive in your country?\nThey are reasonable, but cinema industry is not that popular in my country.\n3.What are the advantages of seeing a film at the cinema?\nI guess it’s all about the atmosphere. people go to cinema to watch the movie on a big screen, on IMAX or 3D, however, these are available for home viewers as well. I believe it’s a matter of perspectives."
    },
    {
      "url": "/speaking/part-1/computers/",
      "content": "1.Do you use computers?\nI have an HP laptop and I just love it. Can’t imagine how I could live without it.\n2.What do you use a computer to do?\nI use it to scroll on social media, to work on Microsoft Office apps, do some audio and video editing, check my emails. Nothing extraordinary honestly.\n3.Do you think computers changed your life a lot?\nYeah, I mean I have gigabytes of personal data on my hardware not to mention, I use to access my pages on social media. They are sort of my technical extension, so to speak."
    },
    {
      "url": "/speaking/part-1/cooking/",
      "content": "Do you like cooking?\nI think I can say that I am a good cook, so yes, I like the process. It just works as a meditation for me, like when I am cutting the veggies and I can have some time to rethink some of the things which I can’t consider any other time. Also, it is super fun and creative process, which makes me happy about it.\nHow often do you cook?\nEveryday! I cook for my main meals myself and try to come up with different options for snacks in between them. I believe it helps to keep my creativity on a high level.\nWhat dishes are you best at cooking?\nI am flawless at spaghetti Bolognese, which is my favorite meal both to cook and to eat. My friends from Portugal once made this dish for me and ever since that, I am in love with this dish."
    },
    {
      "url": "/speaking/part-1/daily-routine/",
      "content": "1. When do you usually get up in the morning?\nAnswer – Well, I am a morning riser, and I usually get up at 6;30 am. Getting up early in the morning makes me feel fresh.\n2. Do you usually have the same routine every day?\nAnswer – Actually, I am a working person, and on weekdays my routine is the same but weekends make me a lazy person. So, I get up late in the morning.\n3. What is your daily routine?\nAnswer – Well, in the morning, I get up early to have a light breakfast and hit the gym about 7 am. After the one hour workout, I leave the gym and go to the supermarket to buy some fruits and vegetables. Then, I came back home and got ready for work at 10 am.\n4. Do you ever change your routine?\nAnswer – Yes, I underwent a change about two months ago because I had a tight schedule and was struggling to manage my targets.\n5. Is your routine the same today as it was when you were a child?\nAnswer – Actually, I can say that there’s a vast difference between my life then and my present life. You know, when I was a child, besides focusing on study, I had much free time to pursue my interests like watching television and listening to music. But now, my routine and time management has become strict."
    },
    {
      "url": "/speaking/part-1/emails-letters/",
      "content": "1. Do you write many letters or emails?\nYes, I use email nearly everyday to contact my friends all over the world. But I write letters not so often, maybe once a month.\n2. What are the differences between emails and letters?\nThere are a few differences. Emails are very free, convenient, and most importantly, veryfast, but emails cannot contain your emotion, and we hardly review emails later. Letters are different. They are inconvenient, and need a long time to be received, but letters may convey your emotions better.\n3. What kind(s) of letter/email do you think is (are) the hardest to write?\nI think emails to professors are the hardest to write, because I will be afraid if I don’t use the proper word or make him or her feel uncomfortable. But as for friends, we can write to each other quite freely.\n4. How do you feel when you receive a letter or email?\nI will be very glad to receive a letter or email, because it means that there is someone who remembers me, and sends me something for greetings, or if they have something to discuss with me, I am also pleased to reply to them.\n5. What kinds of emails (or letters) do you receive that make you feel happy?\nWhatever I receive, I will be glad. Of course, if my friends tell me some happy news about them such as weddings, or being admitted to a good university, such as Stanford, I will bereally glad to share the happiness with them.\n6. Do you think people will still write letters in the future?\nYes, I think so. Because I think emails cannot take place of your emotions filled in the writing letter, and that’s why you can see people still sending postcards, or writing letters toeach other even they are really far away.\n7. Do you keep letters?\nYes. I kept a lot of letters from elementary school until now in my drawer. When I have freetime, I will take the letters out and review them. It seems that I return to that time, so I value the letters I keep.\n8. How do you get on the internet?\nI use the broad band of Uzbek Telecom to get on the internet. There’re actually two computers in my home. Now we use a router so that two computers can get online at the same time. Recently, I bought a smart phone, which can enable me to get online even when I’m outside.\n9. Is the internet very popular in Uzbekistan?\nThe internet is very popular in Uzbekistan. Now, we use the internet in every aspect of our life.We use it to entertain and search for information. It’s also a very important way for us tocommunicate with each other. To be honest, because of the internet, I haven’t written a real letter for more than ten years.\n10. How can people learn things on the internet?\nA lot of people post their own experience on the internet and sometimes, you could also findsome video clips that teach you how to do things. For me, I love reading Wikipedia to gain knowledge and solve my questions. Also, a lot of people use online courses to get theirdegrees without going to the campus, which is really convenient for our life.\n11. Do you write letters to your parents often?\nNot really. Now, I use the cell phone all the time because I could receive the respond immediately so that I could communicate with my parents easier. If I write letters, I have to wait for a while to receive the reply, which will make me feel anxious. However, I sometimes write emails to friends that I haven’t heard from for a long time."
    },
    {
      "url": "/speaking/part-1/family/",
      "content": "1. How many people are there in your immediate family?\nThere are four people including me in my nuclear family and these are my dad, my mom, my younger sister and me.\n2. Who do you get on best within your family?\nSurely it is my mom, because she is always there for me no matter what and also gives her valuable and experienced advice on any topic I would ask her.\n3. What do you do together with your family?\nEveryone is usually busy with their own work and studies, so the only time when we spend some time together is catching up over the dinner. We usually watch TV, have a meal together and chat for a while around the laid table."
    },
    {
      "url": "/speaking/part-1/films/",
      "content": "1.What kind of movies do you like?\nI love psychological thrillers that run shivers down my spine. They are not so vulgar and cliche as horrors, but there is something really gut-wrenching about them.\n2.Do you usually watch films alone or with others?\nI like to watch my films alone. By doing so, I am sure I pay attention to every minute detail, every special effect and sound effect that is used in the movie.\n3.Which actor would you like to play you in a film?\nI think it’s Rami Malek, as he can portray pretty much all personality types."
    },
    {
      "url": "/speaking/part-1/food-cooking/",
      "content": "1. Who does cooking at your home? Why?\nMy grandma does cooking at my home. I was left to be under care of my grandma since my parents went to city to make a living while I was live years old. My grandma cooks all yeararound except on holidays when my mother is at home in charge of housework.\n2. What do you think of cooking program in China?\nThere are kinds of popular cooking programs nowadays, and they are shown mostly in TV. I think the kind of program is meaningful. Chefs, or sometimes housewives, are invited to share their own way of cooking a dish in the program. Their experience is useful for learners who’d like to try cooking themselves.\n3. When was the first time you did cooking? What you cooked?\nThe first I did cooking was on a summer day at my twenty. That day I made two dished with the help of my grandma. The first dish I made was “the tomato fries the egg”, my favourite food. Though I was a bit nervous, I did it right, however it’s not as delicious as that cooked by grandma. Then I tried the ‘pork braised in soy sauce’, which I had much difficulty in getting the pork to be easy to chow. It’s not bad as my first try.\n4. What food did you like to eat when you were a child?\nI like to eat fast food such as KFC very much when I was a child. Although the media says fast food is not good for our health, as a child, I didn’t care much about those things. As far as the food is delicious, I like to eat the food.\n5. Do you think it’s good to (often or sometimes) take children to restaurants?\nYes, I think it is good to take children to restaurants sometimes. My parents would take me to restaurants since I was very a child, and I learned the table manners when eating outside.\n6. Do you think it is important to cook at home? Why?\nOf course. There’re at least three advantages for cooking at home. First, you can eat many delicious foods at a reasonable price. Second, food cooked at home is much safer than that in restaurants. Finally, it is very good to enjoy dishes together with family members.\n7. What is the feature of the home-made food?\nThe most important feature of home-made food is that food cooked at home is much safer than that in restaurants. And home-made food contains our love for family members, and this is hard to compare with foods made in restaurants by chefs.\n8. What kind of food is popular in your country?\nUzbekistan has a vast territory, so the popular food varies from place to place. Generally, there is some food that is very popular such as dumplings. According to places, the filling for dumplings is a bit different, but most people like to eat dumplings very much. At the Spring Festival, many families will also make dumplings themselves and share with friends and relatives.\n9. Do people in different places like different kinds of food?\nIt’s natural that people in different places like different kinds of food. They grow up in different climate and environment. For example, people in Sichuan and Hunan province all like spicy foods, but there is a bit difference even between the two. People from the southeast tend to prefer sweet food.\n10. Who usually does the cooking in your family (or, in your home)?\nMy mom usually does the cooking at home. My father can’t cook, so my mom takes the job to cook for the family. Sometimes I will also do some cooking if I want to try new dishes.\n11. Did you learn how to cook when you were younger (or, when you were a child)?\nNo, actually I didn’t learn how to cook when I was a child. After I grew up, I gradually learned how to cook, and I find I like it very much. Cooking is a very interesting thing.\n11. In the future, do you think you will be cooking more than you do now, or less? (Why?)\nOf course. Now I am a student, so I just cook for myself if I’m away from home. If I get married, I need to cook for my family members. Also, I need to make bento for my children, so I will be cooking more than I do now.\n12. What kind of food do you think is healthy?\nI think there is a lot of healthy food and how you cook it is the most important. Usually deep fried food or food that contains too much sugar or salt is considered bad for our health. We should eat a balanced diet and try to cook the food in a healthy way.\n13. Do you think Uzbek people’s diet is healthy?\nYes, a lot of Uzbek people pay attention to the food we eat, and many of us like eating soup or vegetables. I think that’s pretty healthy. But I have to admit that nowadays because of the fast pace of living, many people have to choose fast food for lunch, which is usually not healthy.\n14. Will you change your diet habit?\nYes, I’d like to make some changes. I actually eat too much junk food, which really makes me fat and unhealthy. In the future, I think I should learn how to cook by myself so that I could make healthy and delicious food at home. Also, I don’t eat enough vegetables, so, in the future, I should try to have vegetables for every meal.\n15. Do you like tasting new food?\nYes, whenever I’m in a new place, I would always try my best to find the famous local food and have a taste. I think food cannot only satisfy my stomach but also can help us understand the local culture. However, sometimes, it’s not easy to get used to the new food for the first we try it.\n16. Do you like lunch or dinner?\nProbably dinner,because I usually have some fast food for lunch,which is not nutritious and doesn’t always have a good taste. But our family usually can prepare the dinner together and we’ll have several dishes and a soup for the meal. I love it not only because of the variety we could have, but also because of the family time we spend."
    },
    {
      "url": "/speaking/part-1/food/",
      "content": "What kinds of meals do you like?\nI like food rich in protein, carbohydrates and different vitamins and minerals as I work out regularly and my body needs bio fuel to grow new muscle mass and to maintain the existing one. I prefer, raw as well as boiled and steamed veggies and some beef and fish.\nDo you often have dinner with your family or friends?\nNot really. Since I live on my own, seldom do I catch up with my friends and family members over a meal. However, I like it this way as it makes each and every occasion special.\nWhen do you usually eat dinner?\nI try my best to stick to nutrition regime, so I usually have my dinner at around 7 p.m. The time is enough to digest the whole meal before going to sleep."
    },
    {
      "url": "/speaking/part-1/free-time/",
      "content": "What do you enjoy doing in your free time?\n\nSince I am in charge of my time fully, I have plenty of free time, however I just try to make sure that I don’t have any free time, so that I won’t be doing anything unproductive or time-wasting. The more free time you have, the more stupid you spend it, as it’s been proven.\n\nHow much time do you have each week for doing these things?\n\nAgain, I try to make sure I don’t have free time at all. I am constantly grinding on my own.\n\nWhy do you like doing these activities?\n\nThe reason why I don’t let myself chill even for a second is because I am young and strong and have a sharp mind, which I am using to guarantee myself a better future. I know for sure that I won’t be this good for a long time, so try to use all of the time in my command to make it in time."
    },
    {
      "url": "/speaking/part-1/friends/",
      "content": "1.Do you have a best friend?\nYes, I do. His name is Dilmurod but I call him Dima for short. Dima is a year 5 medical student at Bukhara State Medical University.\n2.How often do you meet with your friends?\nNow that we’re all adults, we can not see each other as often as we used to. However, during winter and summer breaks, we have our traditional gathering and hang out together.\n3.What do you spend your time with them?\nOftentimes, we go to a cafe, have a bite and try to catch up with each others’ lives and find out what we have been up to. Then we go for a little stroll around the town."
    },
    {
      "url": "/speaking/part-1/friendship/",
      "content": "What will make you happy in the future?\nAs I grew older, it came down to me that happiness is not about achieving or not achieving certain ambitions, but rather something that I have always had with me from the get-go, but failed to appreciate. It is those little things in life like a cup of a cappuccino or a late afternoon studio grind which make me content, and I hope I’ll have more chances to experience something similar in the future.\nWhen do you feel happy at work?\nI used to take pride in my students’ results, which would make me feel like a proud father with a shed of happiness tear in my eye. Now, I feel joyous when our team successfully accomplishes certain tasks and we get onto the next level.\nDo you feel happy when you buy new things?\nIf the item is or has been on my wish list for a while or I’ve been really craving it. The feeling wears off as long as I get the hang of it, but when I use let’s say my new microphone, it always makes me remember that purchase experience.\nWhat made you happy when you were a child?\nAnything from watching cartoons late at night to taking a ride in an amusement park. All the sweets, toys, and playing out also falls into this category as well."
    },
    {
      "url": "/speaking/part-1/furniture/",
      "content": "Do you have a lot of furniture in your home?\n\nWell, I’d say quite moderate amount of furniture. I don’t like cramped spaces, rather my heart carves for more open space interiors. Plus, I’m a minimalist, so furniture for me is an extra fancy that I don’t really need.\n\nHas anyone bought a piece of furniture for you?\n\nI tried selling my old set of furniture, however I didn’t succeed. The good thing is it’s now in my cottage standing outside as a cool spot for siesta.\n\nWhat kind of furniture would you like to buy?\n\nI am into minimalism, so I like appreciate multi-functional stuff which doesn’t attract much attention. Something simple, practical, and down to earth will do me just as fine."
    },
    {
      "url": "/speaking/part-1/gifts-2/",
      "content": "Do you like receiving gifts?\n\nWho doesn’t! I get flattered when someone presents a gift to me. It shouldn’t be something big or material – a little thing can make my day and make it to my heart as a long-lasting sweet memory I’m ready to reminisce over and over.\n\nWhat kind of gifts do you like receiving?\n\nI don’t like big stuff. Could be a bar of chocolate, a watch, a nice pair of headphones, basically whatever. It’s not about the stuff, it’s about the sheer attention and care to me.\n\nWhat gifts did you receive in your childhood?\n\nWell, I was that spoiled kid. I had a lot of toys, most of which obviously were cars. However, when I grew up I picked up a taste for books as gifts and when asked, I used to and still say to people to get me a nice book."
    },
    {
      "url": "/speaking/part-1/gifts/",
      "content": "1. What is your favourite gift?\nI received lots of gifts from my relatives and friends, among which I liked the bicycle best. It’s a birthday present from my parents when I was ten, and it’s rare to have a mountain bike at that time. I used to ride it to study and it makes my life more convenient.\n2. Have you ever received a gift that you didn’t like?\nWell, I haven’t received any gift I dislike, but I do have gifts I pile up for years, such as soft toys. I don’t like soft toys so much as other girls, and I have about twenty toys in various types in stock.\n3. When was the last time you received a gift?\nActually it is today. My best friend came home from Taiwan, and she bought me some delicious snacks from Taiwan, so today was the last time I received a gift, and I love the taste very much.\n4. Do you prefer receiving a gift or giving a gift?\nI prefer receiving a gift. For giving a gift, I need to consider the interest of that person, and sometimes it may not be accurate, so it is very hard to send gifts. But for receiving a gift, you can decide if you like it or not.\n5. Do you think it’s difficult to choose what gift to give to people?\nOf course it is very different to choose gifts for people. Everyone is different. I need to consider the interest of that person, and sometimes it may not be accurate, so it is very hard to send gifts.\n6. What were the gifts you sent to others recently?\nI sent to my friends some cosmetics such as the eye shadow makeup or the daycare cream. Besides, I also sent one of my friends a blue bag that is very cute, and she liked it very much.\n7. Do you like giving gifts to your friends?\nYes, of course. I always bring some gifts to my friends if I travel. If they like my gifts very much, I will also feel very happy. So I like to choose gifts for them. Also, gifts can express my love to my friends or family members."
    },
    {
      "url": "/speaking/part-1/home/",
      "content": "1. What can you tell me about the place you live in?\nI live in one bedroom apartment on the 3rd floor of the apartment block in the central neighborhood in my hometown. The accommodation here is considered one of the best in the entire city, so I am lucky on this.\n2. Is there anything you would like to change about the place you live in?\nI’d really like to change the old windows to modern tinted ones and also replace the radiators, which are quite old. Also, I am considering a capital refurbishment in the apartment.\n3. Do you plan to live there for a long time?\nIt’s hard to say anything about long-term, but I guess for the next 2-3 years, I am gonna stay here."
    },
    {
      "url": "/speaking/part-1/hometown-2/",
      "content": "Where is your hometown? How long have you been living there?\nI’m from XX, the capital of XX province. I was born and raised in that city until I went to study in XX two years ago. I enjoy the time studying in the city, too. I’m from XX, a small city in XX province. Living there for the past twenty years, I’ve been to almost every comer of the city and know many good restaurants. It’s also interesting when I go out because I could always run across some acquaintances.\nIs your hometown famous for anything?\nYes, my hometown is famous for the local food, XX. Everyone who comes to my hometown would try this food. Also, there’re some famous tourist attractions and the most famous place is XX, which would attract people from all over the world.\nWhat do you like most about living in your hometown (or, about living where you are living now)?\nI love the local food. I have to admit every region has their famous food and it’s hard to find authentic food of my hometown in other cities, so I would always miss the delicious local food when I’ m away.\nDo you like your hometown?\nOf course! Who doesn’t like his hometown? And from among all the aspects, I love the local food most. It’s hard to find authentic food of my hometown in other cities, so I would always miss the delicious local food when I’m away.\nWould you say it’s an interesting place?\nYes. Though it’s a small place, there are some scenic spots. Modern facilities for entertainments are also built up in downtown areas. So we can always find something interesting to do when getting together with friends. And if you have time, I may be your guide to have a tour around there.\nWhat would you say are the good points and the bad points of your hometown?\nWell, the local food is definitely a good point, and the native people are hospitable. In the past, the environment was among the best in the neighboring areas. But the protection has not been attached importance to. So now pollution has become one of the most serious problems in my hometown.\nDid your friends also grow up in the same place as you?\nMy old friends are mostly former classmates and neighbors in my hometown. Since I attended the university, I have been making new friends coming from different areas.\nWould you like to live there in the future?\nYes. There is a Chinese saying; Fallen leaves return to the roots. So even if I may have further education and future jobs in bigger cities, I will go back to my hometown and live there when I grow old."
    },
    {
      "url": "/speaking/part-1/hometown/",
      "content": "1. Where is your hometown?\nI come from a city called Navoi, which is the administrative centre of the Navoi region. The city was founded in 1958 and covers the area of 35 sq. km, however due to consistent construction boom the city is gradually expanding day by day.\n2. What do you like about it?\nInitially, since I grew up here, I have a strong belonging to this place and people. On top of that, the crime rate is so low that I can walk out at night freely not worrying about anything. Last but not least, life expenses here are are reasonable, which attract a lot of people to settle here in Navoi.\n3. Were there any changes in your hometown in recent years?\nOver the last two decades, my hometown has been through some serious changes. Initially, it has become more urbanized with a large number of high rise buildings introduced over the period. Also, it has expanded and still is being expanded due to construction boom. Lastly, the population has grown as there has been a flow of inner country migrants throughout the period."
    },
    {
      "url": "/speaking/part-1/house-flat-apartment/",
      "content": "1. Do you live in a house or a flat?\nI live in a rented Oat in Hangzhou. I’ve been living in the flat for over three years since I found a job here.\n2. Do you prefer to live in a house or a flat?\nI’d like to live in a house as the one my family have in the countryside. There is much space in the three-storey house where my parents, my brother and my grandma live. We have a garden backyard where we plant many flowers which are my favourite. However, it’s impossible to enjoy that while living in a flat.\n3. Why do you like your home?\nI like my home for there are my family. There is no comfortable place as a home. My family at home give me comfort, making me feel safe.\n4. Which room you like best at your home?\nI like my study best. I spent a lot of time in the study where there is a full shelf of books. I like reading, especially novels. Each year I received books as gifts from my relatives. I used to invite my friends to study with me in the room, and we often lost ourselves in reading books there.\n5. Do you have a plan to move to a new house/ flat in the future?\nI’ve been living alone in the flat, and I seldom have time to go back home. In the future I hope to buy a flat in the city, in the following two or three years if possible. Though I prefer to have my own house, I cannot afford the high house price.\n6. What do you think can be added to your flat?\nMaybe a dancing room that has lots of mirrors, because in that way, my mother and I can practice dancing in our spare time at home, and we don’t need to go to the fitness club.\n7. Do you know your neighbors? Is it good to know your neighbors?\nYes, I do. We have a really good relationship with my neighbors, because we will send each other foods or other things. Also, we will help each other if we encounter some problems.\n8. Do you prefer young or old neighbors?\nI don’t mind. I believe that everyone in the world in very kind, so no matter my neighbor is young or old, if we treat each other friendly, we must get along well with each other."
    },
    {
      "url": "/speaking/part-1/internet/",
      "content": "1.How important is the Internet to you?\nMost of my job is on the Internet and my job requires network connection as well, so I would say, it is essential to me and my work.\n2.Do you use the Internet more for work or in your free time?\nSort of both, actually. I’m always connected to the net, so it does not really matter whether I am busy or not. I am just used to being online so that I can check anything if needed at anytime.\n3.Do you think you use the Internet too much?\nEven though I am online 24/7, most of the time my devices don’t do pretty much anything. I just like staying connected so that I won’t waste time turning my data on or connecting to WiFi. So, I use it only when I have a necessity to do so."
    },
    {
      "url": "/speaking/part-1/jogging/",
      "content": "Do you usually jog in the morning?\nNo, I don’t. My job requires frequent movements and pacing, so I get my moderate workout throughout the day at work.\nWhen was the last time you jogged?\nIt was last year in April. Back then, I had a workout buddy who would keep up my enthusiasm and cheer me up. But then he suddenly disappeared and I haven’t done it since then.\nWhere do you usually go jogging?\nThere’s an artificial lake in Alisher Navoi park here in my hometown and it is the most popular destination for jogging and running, so I go there by default."
    },
    {
      "url": "/speaking/part-1/keys/",
      "content": "Have you ever locked yourself out?\nOnce I was in a rush and left my keys in the drawer. While returning home, it clicked that I’d left them there, so I had to stay in a nearby café and binge-watch some videos on youtube until my sister came to the rescue.\nDo you think it’s a good idea to leave your keys with a neighbor?\nCategorically depends on who is this neighbor and how well I know him/her. I mean I wouldn’t leave the keys to my flat where there’s so much that could be taken out to a stranger, but I would probably trust my next-door neighbor as I’ve known her for a decade and she’s okay with such things.\nHave you ever lost your keys?\nNot any instance that I know of. But I always put them somewhere while my thoughts are rushing, and then walk around the home like an idiot trying to find them.\nDo you always bring a lot of keys with you?\nI have only a couple of keys for each of the locks on my door with me and if I’m not having them with me, I’m not leaving anywhere."
    },
    {
      "url": "/speaking/part-1/laughing/",
      "content": "Do you often laugh?\n\nYes, I try to stay positive as much as I can. Laughing serves as a free therapy, so why not?\n\nDo you like to make people laugh?\n\nYes, it’s magical when I can pull this off. Watching people being happy with what I do or say makes me elated for real.\n\nDo you like watching comedies on TV?\n\nI don’t watch Tv, so I watch my comedies on streaming apps and online cinemas. Hopefully, there are tons of these and you can choose what you like for yourself."
    },
    {
      "url": "/speaking/part-1/library/",
      "content": "Did you go to a library when you were a kid?\nNo, I was a TV-era kid, so I grew up watching Cartoon Network and Disney. But I used to read from time to time and it actually was quite a pleasant experience.\nWhat kind of people would go to a library to read and study?\nWell, it depends on whether the library is a public one or for a specific group, say students. But on the whole, there are a lot of people who like to work, study and just hang out at the library because of its stoic atmosphere.\nDo you often go to the library?\nI’m not a library member, though I used to be during my exam preps. It was a go-to place where I could do my tests and write essays without interruptions.\nAre libraries popular in your country?\nNot really. Our people seem to be more entertainment-oriented and education is not a priority here, honestly. I wish this would change and we’d see more public libraries with 24/7 service and other modern-day features."
    },
    {
      "url": "/speaking/part-1/lifestyle/",
      "content": "1.What do you do in your free time?\nI am self-employed, so I mostly decide how to delegate my free time on my own. I usually work on several projects and have some me time for self-care and other daily routine.\n2.Do you have a busy social life?\nAs an introverted persona, I wouldn’t say I am very social but my job requires more or less social interaction but luckily I am used to that.\n3.Has your life changed much in the last year?\nThere’s been a u turn in my life since last year. Now, i am at the moment in my life where I have always wanted to be so really enjoy what I’m doing now."
    },
    {
      "url": "/speaking/part-1/living-area/",
      "content": "Where are you living now?\n\nI live in one bedroom apartment on the 3rd floor of the apartment block in the central neighborhood in my hometown. The accommodation here is considered one of the best in the entire city, so I am lucky on this.\n\nWhat facilities are there in your area?\n\nIt’s all included in there. 3 schools, 3 kindergartens, a supermarket and two drugstores – I can not think of anything else that one can be in need.\n\nWhat do you like most about your area?\n\nIt’s location and interior. I mean, Ive spent considerable amount on making my place super comfy and chill, and also it’s in good neighborhood."
    },
    {
      "url": "/speaking/part-1/major/",
      "content": "1. What’s your major?\nI major in preschool education. I’m in the third year, and I look forward to the internship when I will work in a kindergarten in the fourth year.\n2. Do you like your major?/ Are you interested in your major? Why?\nYes, I do. I believe preschool education is meaningful. Thanks to the teachers teaching me in the kindergarten, I had an enjoyable childhood. I learned to sing, dance and painting. I had a lot of playmates, many of whom are still my friends. So I want to learn to be a teacher like them.\n3. Why did you choose your major?\nI chose my major for it’s my dream to be a kind teacher. I want to be qualified to be a good teacher, so I can take up teaching kids, who are innocent and creative.\n4. Is there anything interesting of your major?\nFirstly, some of our lessons are interesting. We have art lessons, of course we are not taught to be actors, in which we learn some basic skills, such as drawing and dancing. In this way, we will be able to make our class more attractive to children in the future. Then the internship when we assist teaching work in schools is the most exciting part of our major, and that’s also the beginning of our practical study.\n5. The advantages and disadvantages of your major.\nNowadays, people pay more attention to preschool education, and parents are eager to send their children to a high-quality kindergarten. Therefore, the obvious advantage is that students of the major will not have much difficulty in finding a job. However, except for teaching in kindergartens, we have limited choices of doing something else, that’s why not so many students are willing to take the major.\n6. Will you take up a job relating to your major?\nYes, of course. I am striving to be an excellent teacher. I will work hard to get the certificate, with which I will be eligible to teach in a kindergarten. I am enthusiastic and hopeful. Although years later, I might get tired of teaching some day in the future, I will never regret what I choose to do.\n7. When is the best time in a day for you to study?\nThe best time for me to study is in the morning. I prefer to recite books for an hour before having my first class at eight fifty. I have seven-hour sleeping everyday. After a sound sleep the night forward, I am refreshed and my mind is clear. It’s the best time when I can study efficiently."
    },
    {
      "url": "/speaking/part-1/math/",
      "content": "Do you like math?\nI hate maths, because at school I was not particularly good at, in fact gifted at all at maths, and I used to struggle a lot with it. I still do not understand how those formulas and theorems can be applied to daily life.\nWhen did you start learning mathematics?\nIt’s a common practice in my country to teach kindergarten kids some basic arithmetics, like adding and subtracting, so I guess it was kindergarten where I learned my first maths.\nHow do math skills help us in daily life?\nI’m actually quite in the dark about it, because except for elementary arithmetic operations, I hardly see any practical use for maths. I guess that is why they do not have a Nobel’s prize for maths as it is completely theoretical."
    },
    {
      "url": "/speaking/part-1/movie/",
      "content": "Do you like watching movies?\nActually, one of my favorite hobbies is watching movies. It doesn’t really matter whether I am watching one for the first time or re-watching it again, what I like about is that I love the camera work, actors play and as well as sound design and track selection.\nWhat kind of movies do you like?\nI used to like horrors when I was a teenager, but now I am interested in psychological thrillers, which run shivers down my spine although there is nothing much going on the screen compared to the horrors.\nWhat is your favorite movie?\nMy favorite movie is a 2002 Sony Picture’s Spiderman starring Tobey Maguire. The plot goes around an average teenager Peter Parker, living with his uncle and aunt. One day, he gets bitten by an experimental spider at the lab where peter’s class take a day trip to, and since then he leads a double life. The movie portrays all the changes, struggles and battles of a daytime high school student and a night time superhero."
    },
    {
      "url": "/speaking/part-1/music-2/",
      "content": "Do you like listening to music?\n\nAs a music producer, I listen to music for several purposes and unlike general audience, who listens to music for pleasure, I also analyze, break down, assess and try some new genres out for myself.\n\nWhen do you listen to music?\n\nWhenever I feel like to, honestly. I mean I don’t have certain fixed time on my schedule for listening to some bangers and hits. If I want to, I take my phone, plug in my headphones and launch the Spotify, where I listen to my tracks in a high quality. I just value the quality of the sound as a producer.\n\nHow much time do you spend listening to music every day?\n\nI am a little foggy about it, but I guess it’s something around half an hour of daily playtime. I can listen to the same tracks or decide to listen to some new releases and pick my favorites from them."
    },
    {
      "url": "/speaking/part-1/music/",
      "content": "1.Do you listen to music?\nI am a part time music producer so I can say it’s part of my job. I listen to analyze, to compose, to compare, to refer and to rate and react to different genres of music.\n2.What’s your favorite kind of music?\nit’s hard to point out exactly one genre, however, I’m mostly into electronic dance music. It’s a branch of music which is popular nowadays and contains dozens of different genres and sub-genres.\n3.What kinds of music are (most) popular in your country?\nFolks here listen to uzbek pop as one can predict. There are some big names in the industry which constantly stamp generic stuff, but I am not a big fan of that, actually."
    },
    {
      "url": "/speaking/part-1/name/",
      "content": "1. Do you like your name?\nYes, I do like my name very much. My name was given by my parents and it carries a very good meaning, which means happy. I believe this name can bring me good luck and I’ll be happy all the time.\n2. Are there any special meanings of your name?\nYes, my name in Chinese pronunciation means “happy” because my parents want me to lead a happy life in the future, and I can smile to every circumstance encountered.\n3. Who gives the names in China? What’s the tradition of giving names?\nIn general, parents will give the children the name, but sometimes, grandparents will also take part in the naming process. I think it is universal around the world. In every country, relatives will give the children names.\n4. Are you willing to change your name? Why?\nNo. First, I like my name very much, and I don’t feel it necessary to change my name. Second, name is just a small part of me; people get along with me, not with my name. So it doesn’t matter.\n5. What meanings are there in the nicknames of Chinese children?\nMost children in China will have a nickname for different reasons. Some people believe a nickname will bring their children blessings, and some others want to call their children more conveniently.\n6. In your country, do people feel that their name is very important?\nWell, every Chinese name carries a meaning, and it represents the common value and pursuit of the family. So people usually consider their own names unique and important.\n7. Is it easy to change your name in your country?\nIt’s not so easy. Firstly the family members should come to an agreement on that. Then I have to go to the police station for registration. And all the friends and acquaintances should be informed.\n8. What names are most common in your hometown?\nThose with nice meanings. A lot of boys are given names like Da, meaning making achievements. And girls’ parents prefer characters such as Fang, implying fragrance."
    },
    {
      "url": "/speaking/part-1/neighbours/",
      "content": "Do you know all your neighbours?\n\nNot really. I mean, I know my next door neighbor, I don’t know all of them. I believe it’s an extra information that I don’t really need and I do not want to intervene to people’s lives, nor do I want others to do so to me.\n2. How often do you talk to your neighbours?\nOn a daily basis. Nothing specific, just exchanging some pleasantries.\n\nHow well do you get along with your neighbours?\n\nI’m in good contact with my next door neighbor, our families maintain friendship. However, I don’t go beyond small talk with other neighbors."
    },
    {
      "url": "/speaking/part-1/newspaper/",
      "content": "1.Do you often read newspapers?\nI have stopped reading newspapers for about 2 years by now. I get my news online, and the fun part is that the algorhythm makes sure I get the news which I actually like to read unlike in newspapers.\n2.Do you prefer to read local news or international news?\nI prefer both, because I want to make sure about what is going about both inside the country and abroad.\n3.Which is more popular where you live, newspapers or magazines?\nPeople prefer newspapers because of Magazines being more expensive than newspapers."
    },
    {
      "url": "/speaking/part-1/outdoor-activities/",
      "content": "Do you like outdoor activities?\n\nNot that I am an active person, however I do realize that I need them. I am still into strolling around the town with my friend, it’s very mind-refreshing.\n\nWhat kind of outdoor activities do you do?\n\nAs I mentioned just now, I am into taking a walk around the city with a friend of mine. It’s nothing much, I at least, I get to enjoy the views and take some moderate workload on my skeletal musculoskeletal apparatus.\n\nHow often do you do outdoor activities?\n\nAt least once a week. Still, it depends on factors like my mood and to what extent I am busy and weather conditions."
    },
    {
      "url": "/speaking/part-1/painting-drawing/",
      "content": "1. Do you like painting/ drawing? Why?\nYes, I do. I used to be fancy of drawing when I was in primary school. I just enjoyed copying the figure in my drawing book and making use of any color as I like. I felt proud of being praised by my relatives when they saw my drawing pasted on the wall of my house.\n2. Do you think children should learn drawing?\nIt depends. If a child has interest in drawing, it’s OK for him to do. Parents should encourage their children to do what they like. However, it’s useless to push every child to learn drawing.\n3. Why do primary schools have painting class?\nIt’s said it’s a great time for children at primary schools to do painting for plenty of advantages. Children can express what they think of the world through drawing, and many enjoy the various colors. Besides children will think for the figure they’d like to draw, the tool they need to complete their painting. Children will be more creative in the process of doing painting.\n4. Why do people display art work (painting) at their homes?\nMost people do that because of their love of art work. For example, people in love ofphotographing, though they are amateur, and they prefer to hang the pictures they took at home.Also, there are people enjoying art work as a kind of decoration, and they like to appreciateworks of others. For instance, many wealthy people like to collect and display famous art work.\n5. Have you ever bought any painting?\nYes, I have. The only painting I bought was the one sold at the charity activity held in my secondary school. Each year, a fete will be organised when students donate something to sell to others, and the money will be collected to help students from poor families. The painting was a copy of the famous painting “Playing Shrimps” by a new student, whom I made friends with later.\n6. Do you think painting (or drawing) is important for adults?\nYes, I do. Adults can draw or paint what they like in their spare time. It is a hobby that won’t disturb others, and you can enjoy it very much if you can explore it deeply.\n7. Do you still draw those pictures that you did in your childhood?\nNot really. I don’t draw the sun, flowers, and trees as I did in my childhood. Now I draw those elements in a different way, in a more abstract way."
    },
    {
      "url": "/speaking/part-1/patience/",
      "content": "1. Is it important to be patient? Why?\nYes, it is, because people won’t do things successfully without being patient. For example, people, more or less, had the experience of making mistakes on a math test because they were not patient enough. Patience, however, enables people to discover where the trap lies and find the key information to a correct answer.\n2. Is it easy to be patient? Why?\nWell, it depends, some people are patient while others are not. Patience is an expression of one’s mood and character. To be patient is not easy, but patience can be developed through habit. It’s said going fishing and practicing handwriting helps people to slow down and be patient.\n3. How can people be patient?\nPeople lose patience when they meet what seemingly insoluble or when, what they are doing costs longer time than they expected. So I think people should been optimistic, and have an overall judgment of what they engage in. Besides, they can set up goals step by step to reach a final success and they should encourage themselves by whatever improvement they make. In this way, people won’t get upset and easily lose their patience.\n4. When do people need to be patient?\nPeople need to be patient all the time whatever they are doing. For example, researchers have to spend months or years to collect data for their experiments, and they may repeat a single experiment again and again. Without patience, they may make mistakes or could not hold on to the end.\n5. What do you do when waiting for the bus or something else?\nWhile waiting for a bus, I prefer to play games on my cell-phone, or call my friend to kill time. As it is said, the time spent on waiting always seems to be longer than it is. I will lose patience if I do nothing but just wait.\n6. Are people now less patient than people in the past? Why?\nYes, we do. We are now living in a rapid developing world. Flights and high-speed railways enable people to travel around in short time. Fast food or take-away food makes it convenient for people to eat while walking. Exposed to the world, people are made to get used to and catch up with the fast pace. They have less time left to be patient."
    },
    {
      "url": "/speaking/part-1/photography/",
      "content": "Do you like taking photos?\nAs an artistically inclined person, I can say that photography is a contemporary form of art and I like to express myself in this discipline quite often. No matter whenever and wherever I am, I have my camera ready for another snapshot which can turn into yet another great shot. It’s all about perfect timing in photography, I guess.\nHow often do you take photographs?\nAgain, I always have my camera steady just in case bump into something interesting worth shooting.\nDo you prefer to take photos of yourself or to have other people take your photos? Why?\nThis actually depends on who those people are. I mean, if it’s a professional, then I fully trust him as a model because he knows his trade better than I do. However, being surrounded with average users, I prefer to take selfies as I know which angle and perspective works best for me."
    },
    {
      "url": "/speaking/part-1/picnic/",
      "content": "1. Do you like going to picnics?\nAbsolutely, I love them! However, due to my consistently busy work schedule, rarely do I get such a chance to enjoy myself.\n2. When was the last time you went to picnic?\nIt was last year in summer. Me and my friends went to our local lake and chose a pretty peaceful place with a lot of greenery for a picnic. We had some snacks; the music was playing throughout the picnic and we had a time of our lifetime.\n3. How do you enjoy a picnic?\nUsually I like unwinding and escaping from the hustle and bustle of the city, specifically the noise. Being surrounded with nature sounds only, my ears get to relax and it is definitely sounds like a music to my ears!"
    },
    {
      "url": "/speaking/part-1/politeness/",
      "content": "Do you think you are a polite person?\n\nI am not the one to say this, but I try to keep the respectful conversation and some common sense while small talking to people. Out of pure courtesy, of course.\n\nWho taught you to be polite?\n\nI don’t know, like, I think it came naturally to me. People were really to me, and I think I thought that is the way I should treat people in turn. Still, I am glad it came out like this.\n\nHow do your family members show politeness?\n\nThey call me cute names, greet me whenever they see me and just keep the friendly tone all the time."
    },
    {
      "url": "/speaking/part-1/public-transport/",
      "content": "What kind of transport do you usually use?\n\nI use mostly taxis, as they are cheap and allow me more or less privacy. Also they get me wherever I want in a relatively affordable price.\n\nHow much time do you spend travelling on a normal day?\n\nAs I work from home, I don’t usually commute, however every other day I may go out to the city and then I can take a 15-20 minutes ride in a taxi.\n\nWhat is the most popular means of transport in your country?\n\nThese are private cars as our people do not quite understand and value the concept of public transportation."
    },
    {
      "url": "/speaking/part-1/rain/",
      "content": "Do you prefer rainy days or sunny days?\nAs a person living in a sunny climate where there are 300 sunny days out of 365 possible, I guess I’m just used to sunny weather. However, I like it when it rains, or when it’s cloudy outside, it just cools down a bit and gives diversity to the weather.\nWhat do you do on rainy days?\nWhen it’s pouring outside, I stay indoors and try to find shelter as quickly as possible. Usually, I’d watch a movie, or do my work depending on how busy I am. If there’s nothing to do, I go and take a nap.\nDo you like wet weather?\nI like the weather after the rain, when there are still clouds in the sky and it’s cool, the weather is humid and it’s easy to breathe. There’s something unusual about mild weather which adds up to its aesthetics, making it more pleasant and appealing.\nDo you prefer wet or dry weather?\nI prefer dry only because I live in one and if it were wet, we’d have some serious trouble breathing here, as it would have been a real boiler room.\nIs there any part of your country where it doesn’t rain much?\nLike, my hometown Navoi was founded in the desert terrain, so there’s little or no rainfall and humidity.\nWhat do you usually do when it starts to rain and you are outside?\nI try to look for a shelter, or hop in a car and get home as quickly as I can. If it’s a light rain, then I can walk freely without being worried to get wet.\nDo you think rain is good?\nIn my culture rain is one of those times when all the prayers and supplications are accepted. In addition, rain is good for agriculture and farming as a part of the natural water cycle. Lastly, a lot of wild animals and plants depend on rain and wet weather and soil, so rain is vital not only in my culture but also for nature itself.\nHow does rain affect life in your country?\nIn spring, there’s a tendency for minor floods in regions prone to wet weather as it rains heavily there. Usually, these are areas close to mountains and hills, and there’s a possibility of all the crops being devastated as a result of flooding, causing scarcity for a particular culture during that period.\nHave you ever had to change your plans because of the rain?\nThere was this one time when me and my friend wanted to set out for a ride but had to call it off because of the rain as it’s risky to drive then. We might fall asleep while being over the wheel and what’s worse get into an accident so we made a safe choice and wait until it brightens up."
    },
    {
      "url": "/speaking/part-1/school/",
      "content": "1.Do you miss your life at school?\nBoth yes and no. I miss those days when I didn’t have to think about life at all. However, I am really glad those days have passed and I have outgrown my previous self and have become who I am now.\n2.Who was your favorite teacher at school?\nIt was my English teacher, Mr.Turayev who had a deep influence on my character and future profession. he served as a role model for me and still does. we still keep in touch with him regularly.\n3.Do you still keep in touch with your friends from school?\nIt’s been like 8 years since I graduated from school and it remains the last time since I heard from most of my school friends. However, there are a few ones who I keep in touch with regularly."
    },
    {
      "url": "/speaking/part-1/schools/",
      "content": "What changes would you like to see in your school?\nTo my biggest surprise, my school hasn’t changed a bit since I left in 2015. It’s the same Soviet-type three-story building that desperately needs capital refurbishment and equipment because when I used to work there, I had a really hard time with network connection, which is a must-have for modern education establishments to my mind.\nDo you go to a good school?\nIt was probably on top of the list which me and my parents could afford. Even though it was free and mandatory, there was one school and presidential schools which used to one-up the school where I studied.\nDid you go to a good school?\nI believe so. I mean I like it here and already made myself home, though it gets hot in here during controls and finals week. But I’m glad to be here, as I have so many friends and it’s also close to my home, so I see it as an absolute win."
    },
    {
      "url": "/speaking/part-1/sleep/",
      "content": "When do you usually go to bed?\n\nI go to bed at 10 p.m and try to make sure I follow this routine everyday. I value my sleep because it helps me to be creative, mindful, calm and productive the next day.\n\nHow often do you go to bed late?\n\nFrequently, but I wish I didn’t stay up at night at all. No matter what you’re up to, it’s not worth sacrificing your night’s sleep, so I think.\n\nWhat do you normally do when you stay up late?\n\nI binge watch YT, scroll on my socials, listen to music or talk with my girlfriend on a video call."
    },
    {
      "url": "/speaking/part-1/sport-2/",
      "content": "1. What is your favorite sport?\nMy grandad was a strong chess player, so I inherited some of his passion and skills towards chess. I love chess because it is all about the strength and flexibility of the minds of players playing against each other.\n2. What kind of sports did you play as a child?\nIn my childhood, unlike now, I had a particular liking for active sports, such as football. However, as I grew older, I lost my interest towards football as I had taken up English by that time.\n3. Do you prefer team sports or individual sports?\nI am not a really good team player, and plus chess, which is my all-time favorite, is an individual sport, so I guess team sports are out of the question here."
    },
    {
      "url": "/speaking/part-1/sports/",
      "content": "1.Do you like outdoor activities?\nI prefer indoors activities, honestly and I believe it has something to do with my lifestyle.\n2.What outdoor sports do you like?\nI prefer swimming, although it could be done in an enclosed reservoir.\n3.How much time do you spend outdoors every week?\nActually, I am not a sports person at all. I wish I would take some sport, but so far my job and hobiies haven’t allowed me to do so."
    },
    {
      "url": "/speaking/part-1/tea/",
      "content": "Do you like drinking tea?\n\nIt’s my favorite non-alcoholic drink because it goes along with pretty much anything.\n\nWhen do you usually drink tea?\n\nWhenever I have something to eat, it is highly likely that I’m having a tea with it.\n\nWho do you drink tea with, friends or family?\n\nEveryone. Tea loves company, and is usually served in gatherings here in my country. Even if you don’t wan to eat anything, you can at least refresh yourself with some tea."
    },
    {
      "url": "/speaking/part-1/time-management-2/",
      "content": "1. How do you organize you time?\nI have a timetable in both my notebook and the cellphone to manage my time. At the beginning of every term I fill in the timetable firstly with the curriculum schedule. Then I can make proper plans of other activities according to the spare time I have.\n2. Do you think young people organize their time in the same way?\nMost of my fellow students do it like me. Study is our prime task anyway, so we have to devote enough time to it. If there is much spare time left, we may consider joining in clubs or doing part-time jobs.\n3. Are you ever late for anything?\nYes, sometimes I sleep over in the morning and was late for the classes. Once I didn’t manage to come back from part-time work to the class-meeting on time. But generally speaking I am a punctual person.\n4. What excuses do you use when you late?\nExcuses will not help anything, according to me. So I told the truth rather than used excuses, and made apologies to the teachers and my classmates. They all forgave me in those cases.\n5. (similar to above) What excuses do people have when are late?\nWell, some people don’t like to use excuses when they are late. They just tell the truth and make apologies then. While some may make up lies or excuses, hoping not to be blamed by others. But the effect doesn’t always turn out to be good.\n6. Do you like it when others are late?\nSome people may mind it, but I don’t really hate it when others are late. I think they must have their own reasons, or no one wants to be blamed for that.\n7. In your country, do people forgive others when they are late?\nIt depends on the exact circumstance. In a serious occasion such as a conference or an appointment, being late is annoying and may not be forgiven. But if it’s a party among friends, I think people won’t care if someone comes a little late.\n8. If you had more time, what would you do with the extra time?\nI have been hoping to learn playing violin since I was 15 years old. But I have never had enough time to do it because I have to spend most of my time studying. So if I had more time I would use it to learn violin."
    },
    {
      "url": "/speaking/part-1/time-management/",
      "content": "1.How do you plan your time in a day?\nI am strict to myself, so I’ve got a daily planner for each single day. Basically speaking, I will finish the most difficult things in the mornings because I feel very active at that moment. As for easier tasks, I would like to put them in the afternoons or evenings.\n2. Is easy to manage time for you?\nIt’s pretty much easy for me to do so, because I’m good at making plans and I have been doing time management since I was a little kid. APPs, to-do list, notebook are all useful for me to manage time.\n3. When do you find it hard to allocate time?\nProbably when I am stuck in some disappointments or shocking things. I mean, it’s not about how hard the things are, but it’s all about how bad I feel. Sometimes I will be emotionally unstable, and that’s the moment I feel hard to allocate time, because I can’t even think for myself.\n4. Do you like being busy?\nIt depends on different situation. But mostly, I enjoy being busy, no matter it’s for work or for my personal life, being busy makes me feel full inside.\n5. Are you good at organizing time?\nWell, as a person to an extent i believe i am good at organising my time. Time management is an essential skill which enables things to run smoothly. So i always plan my day beforehand.\n6. How do you usually organize time?\nI plan my entire day beforehand by setting achievable goals for myself and also prioritise every pending task based on the importance and urgency. Moreover, I am always focused and diligent towards my work.\n7. Do you think planning is important for time management?\nPlanning plays a pivotal role in effective time management. An individual needs to plan his day well in advance to make the best possible use of time. There is no point in working just for the sake of doing work. Planning gives an individual a sense of direction in the organisation and motivates him to complete assignments on time. For instance while I’m preparing for my ielts exam I always plan to cover every 4 modules in a day.\n8. Why do you think some people pay to learn time management?\nWell, some people are not that efficient in planning time so that’s probably what made them enroll in time management courses, on top of that, it is a systematic course that contains several skills and techniques so making those skills handy will enhance work productivity and overall performance.\n9. Do you think children should learn to manage time?\nAbsolutely, learning time management skill at the tender age make children more self- sufficient by organizing or arranging their own time table. Moreover the benefits of the skill will definitely reflect in their future life."
    },
    {
      "url": "/speaking/part-1/transportation/",
      "content": "1.Do you prefer public transportation or private transportation?\nI prefer private transport, as it’s more convenient in terms of privacy. I mean, it’s just me or my family and friends at maximum, whereas on public transport I get to take a ride with complete strangers, some of whom can have some shady intensions.\n2.What’s the most popular means of transportation in your hometown?\nThis is definitely taxis. They are cheap, large in number and are available around the clock.\n**3.How has public transportation changed in recent years?\n**More busses have been allocated for public transportation. Also, there are special wagons in underground specifically for women, so that they can travel safely."
    },
    {
      "url": "/speaking/part-1/travelling/",
      "content": "1.Where was the last place you visited on holiday?\nI think it was my last year trip to Bukhara. I’d never been there before, so it was a really nice experience for me.\n2.Would you like to go back there again?\nYes, of course. It was only a day trip and I would like to stay there for a while and explore it fully.\n3.What kind of tourist destinations do you usually prefer?\nI would like to avoid tourist traps at all. The thing is I want to explore the city for the unseen point of view, which unfortunately is not the case with tourist destinations."
    },
    {
      "url": "/speaking/part-1/tv/",
      "content": "1.Do you like watching TV?\nI hate TV, and think that one of the worst ways to degrade is watching TV. even if I have a TV at home, I don’t watch it at all.\n2.How often do you watch TV?\nAgain, I’m the least TV person one can imagine. It;‘s just a complete waste of time.\n3.What kind of TV programs do you like to watch?\nI used to watch documentaries on NatGeo about different animals, but now I watch them on the Internet, thanks to streaming apps."
    },
    {
      "url": "/speaking/part-1/villages/",
      "content": "Do you like living in a village? Why?\nI think I could enjoy some time there as a time-off from the city life, however I am quite used to urban lifestyle which is in sync with my personality.\nWhat are some of the advantages of living in a village?\nClearly, living in the countryside has some merits. Initially, it’s more peaceful, compared to hustling and bustling cities, where there is a lot of noise during the day and night. In addition, the crime rate is extremely low or does not even exist in the country. Last but not least, rural people have an advantageous access to organic food, which they produce themselves.\nIs there anything you don’t like about living in a village?\nSure. I mean I quite fancy the perspective of living in the countryside, however the infrastructure is not sufficiently developed there, so I am afraid I can get bored easily there without any entertainment and nightlife. However, it sounds like a decent option for later period of my life, when I am going to need peace and privacy."
    },
    {
      "url": "/speaking/part-1/weather/",
      "content": "1.What’s your favourite kind of weather?\nMy favourite weather is when it’s between +15 and +20 degrees, sunny, with little or no clouds in the sky. In this weather, I can usually wear my favourite pieces of my wardrobe so I like really enjoy it.\n2.Is there any type of weather you really don’t like?\nI don’t like wet weather, especially when it’s gloomy and raining heavily. I guess I dislike it because I am so used to the weather in my hometown.\n3.What is the climate like in your country?\nIn Uzbekistan, the climate is severe continental, meaning we have all 4 seasons with cold winters and hot summers. On average there are 300 sunny days out of 365, with little or no rain at all depending on regional differences."
    },
    {
      "url": "/speaking/part-1/weekends-2/",
      "content": "How do you usually spend your weekends?\n\nI just chill doing pretty much nothing, since I can allow myself to do that. I watch movies, scroll on my media or could work for a little bit.\n\nWhat is your favourite part of the weekend?\n\nIt’s probably Saturday nights, when I know that I have a free day, so I give myself some freedom of actions and can let my guard down for a while.\n\nDid you do anything special last weekend?\n\nHonestly, I can’t remember. On the second thought, however, I remember it was the toughest one in my recent memory. I just upgraded my living room with super soft carpet and some new furniture."
    },
    {
      "url": "/speaking/part-1/weekends/",
      "content": "Would you buy T-shirts as souvenirs on vacation?\nI’ll definitely hard pass that. They’re usually overpriced and are not of the best quality for the sake of that. I’d rather get something more practical like a magnet for my fridge.\nDo you think older people who wear T-shirts are fashionable?\nIt’s hard to tell what kind of fashion statement is manifested by judging only one garment. I mean, if they’re going for a de-aging look, T-shirts can definitely help with that on condition that it’s properly matched with the rest of the look including colors, texture and the tone.\nDo you like T-shirts with pictures and prints?\nNot so strong as my liking for plain T-shirts, as they go along with pretty much anything. I can wear them with any type of trousers, tracksuits, shorts, and trainers for street and casual style as well as using them undershirts with a two-piece suit, for a smart casual look.\nDo you usually wear T-shirts?\nYeah, I can say I’m a T-shirt man. I wear short sleeves and oversizes when it’s warm or hot, however, in autumn and winter I use them as an undershirt with a two-piece suit or a jacket.\nDo you like wearing T-shirts?\nI’m always on the move, so I have to be in comfy clothes so that I’m fully involved in what I’m doing. T-shirts really help me out with this so I wear them at home, at the studio, for going out - basically, they’re my go-every-time piece of wardrobe."
    },
    {
      "url": "/speaking/part-1/weekly-routine/",
      "content": "How do you usually start your week?\nI am self-employed, so for me the start of the week is not something big or significant as I can delegate my workload and time as opposed to corporate workers who have fixed schedule.\nCan you describe one of your typical weeks?\nAgain, I am my own boss, so there is nothing much to say about it. My weeks can vary depending on customer demand, workload and my own will to work, so in the end, I get to decide how much and how long I am gonna work.\nDo you often plan your weeks?\nI am a go with the flow type of man, so I deal with things as they come at me. However, I do some basic planning for some important meetings and deals, which I highly prioritize."
    },
    {
      "url": "/speaking/part-1/wild-animals/",
      "content": "What’s your favorite wild animal?\nThe name is the honey badger. They are notoriously well-known for their nasty and tough character as well as their natural defense features in the animal kingdom, allowing them to stand up against such ultimate predators as lions and still get away with it. The thing is other animals wouldn’t want to mess with such a menace, so honey badgers are real badasses in the wildlife.\nAre there wild animals in your country?\nUzbekistan is a mixture of different terrains and landscapes, so the fauna varies depending on the natural habitat. Wolfs, foxes, deer, birds of prey, and other animals are verified to be native to Uzbek wildlife.\nHave you ever seen wild animals?\nI have only seen them at the zoo, where it’s safe to watch and observe them. I’ll think twice before encountering any specimen in the wild because they’re fully driven by their instincts and thus totally unpredictable and I don’t want any complications regarding that.\nWhere can we see wild animals?\nThere are tons of youtube videos about wild animals as well as documentary films available on the web. Also, animals can be observed at the zoo, despite being in captivity. For nature admirers, there are some options such as safari and guided tours into the wild to see animals in their natural state.\nDo you like watching animals in the zoo?\nYes, I like that. They’re used to being there, and they know humans are no threat, so they take it easy, unless not provoked, of course. It’s nice and fun watching them, in their enclosures, and the way they react to visitors, as some of them put on a show for people."
    },
    {
      "url": "/speaking/part-1/work-or-studies/",
      "content": "Do you work or are you a student?\nI’m a student. Now, Tm studying in XX University in XX province and my major is XX, which requires us to do a lot of relative practice. I’m about to graduate next year, but I want to pursue my master’s degree in XX.\nI’m a high school student in XX high school. I’ll graduate next year and I’m planning to study in the UK because I think the education system there is very advanced. I hope I can get into a good university so that I can be competitive in the job market when I graduate. I’m working. I have been working in a private company in my hometown for two years. I think the job is very suitable for me because I could use what I have learned at school and of course there’re also a lot of new things for me to learn in this field.\n1) Your Work\nWhat job (or, what work) do you do? What do you do in that job?\nI’m an accountant in a private company in Hangzhou. My job involves a lot of calculating and tabulating. Sometimes, it’s hard to explain what I do because I don’t produce or sell products, but I think my job is important for the company.\nWhy did you choose to do that kind of work(or, that job)?\nI chose to be an accountant because I majored in accounting when as was in the college. And I had already accumulated some work experience by doing part-time jobs before I graduated. What’s more, the job suits my character and my interest.\nWould you recommend the job to other people?\nYes, I recommend it to people who are majored in Business or Accounting. They may be able to put the knowledge they have learned in the courses into practice. And it is a well-paid job.\n2) Your Studies\nDo you like your major?\nYes, I do. I actually chose my major by myself because I’m interested in science since middle school. When I was a child, I always wanted to be a scientist. Now, I feel I’m closer and closer to my dream.\nIs that a popular major in your country?\nYes, it is. It’s comparatively easier for engineering major students to find suitable jobs because there are a lot of manufacturers in China and they all need professional engineers to work in the R&D department or their factories. I guess the prospect of this major is bright.\nIs it difficult to learn your major?\nKind of. My major involves a lot of math and physics theories, so if one wants to be excellent in this field, you must know the foundational knowledge well. Sometimes, we alsoneed to do some lab work and I think the most difficult part is put what we have learned into practice.\nDo you think it’s important to choose a subject you are interested in? (Why?)\nDefinitely. It’s probably true for everybody. When you’re interested in something, you can put more effort into it and you’re more likely to succeed. However, if you have no interest in something, you probably can do it, but it’s hard to be good at it. So, teachers should try their best to arouse students’ interest and help them to learn unconsciously and students should choose something their interest lies in.\nWhat’s the most enjoyable part of being a student?\nIt’s hard to say. As a student, I can learn knowledge and don’t need to work to earn my living. However, sometimes, I feel it’s hard to be a student because I have too much workload and so many things to learn.\nFor you, what’s the most interesting part (or subject or class) of your course?\nI like practical knowledge. When I learn something about my future work, I would always feel excited. I feel I’m not only learning some theories, but the real skills for my career. It’s the most interesting part for me.\n(For high school) What’s the most interesting of your subjects at school?\nI love science. I think science classes can help me know the wonders of the universe and tell me the laws of the nature. Because of my science classes, many questions I have had since I was a child have been solved.\nWhat are your future work plans? (after you graduate)\nNow, I’m planning to pursue my master’s degree in the UK. After my graduation, I would find a job at one of the world’s best enterprises because there will be more promotion opportunities in such companies. I don’t mind starting from a lower position, but eventually I want to become a department manager.\nWho do you think is more important, the students or the teacher?\nI think both. The classmates can create a group atmosphere, which could be warm, hostile, or indifferent. If you have a bunch of good classmates, you could get help from them in your studies or social life. Teachers are also important. They could teach professional and moral knowledge. If the teachers are dedicated, they could influence the students learning outcomes and world view.\nAre there anything special about your teachers and classmates in this major?\nYes. Professors and students studying science tend to be a little nerdy. We don’t mind spending a lot of time reading or doing experiments. It’s probably true that many of my classmates are not very sociable; however, there’re always exceptions.\nHow should teachers teach?\nTeachers shouldn’t only teach, they should help students learn well and arouse their interests. Since we will leave school sooner or later and there’s still a lot there for us to learn, teachers should foster students’ self-teaching abilities so that they will become lifelong learners.\nWill children tell their parents when they face difficulties in their studies?\nIt depends on the children’s personalities. A lot of children like sharing what happen at school, things both good and bad. It’s always good to get help from\ntheir parents. However, some children feel it’s embarrassing to tell their parents their bad grades at school, which might make them want to hide the truth from their parents.\nDo you think it’s good for teachers to praise the students when they do something good and point it out when they do something wrong?\nOf course. When children get approval from their teachers, they’ll be motivated to do better in the future. When they do something wrong, they also need someone to remind them. However, it’s not good to give complements all the time and too much criticism can also create hatred and make students rebellious.\nWhat subject(s) are you studying?\nI am studying Business. There are many specialized courses related to it, such as Introduction to Business Conference, Marketing Strategy and Business Law &Company Law. I have to study the general courses for all college students as well.\nWhy do you choose to study that?\nI chose to study Business because I dreamed to be a businessman since I was a kid. You know, both my parents are businessmen and I have been greatly influenced by them. I am determined to learn the courses well before I can really set about to practice.\nWhat school/university do you go to now?\nI go to Zhejiang University, one of the best universities in China. Many great scientists and artists, such as Feng Zikai and Zhu Kezhen graduated from this university. The Business College is in the campus located on Xixi Road, in the West of Hangzhou.\nHow long have you been going to that school/studying your subjects?\nI’ve been studying here/this subject for 3 years. Being a junior, I have finished all the required general courses and most of my major courses. That’s why I am preparing for the IELTS test and the further education.\nDo you like studying at that school/university?\nYes, I enjoy studying there very much. With a river flowing nearby, the environment of the campus is quite good. Convenient facilities are available in teaching buildings, the library and mass-media rooms all day along. And teachers help a lot both in the class and in our daily life.\nWhat’s the most important thing/part of your study life?\nIt’s hard to say. As a student, I think I should firstly learn the courses well. However, a lot of my classmates and I are doing part-time jobs in our spare time in order to accumulate some work experience and to social experience. I think both of them are also essential when we are to find jobs."
    },
    {
      "url": "/speaking/part-1/your-job-and-studies-2/",
      "content": "Can you describe your job or studies?\n\nI am self-employed, meaning I work from home and complete my clients’ orders in a designated or agreed time. Then there is usually back and forth sending of the product, just to tweak it so that the client is happy about the service.\n\nCan you describe one of your typical days?\n\nI wake up early at around 4 a.m. Then I have a breakfast and work for a while as I find myself the most productive at this time of the day. I take a short nap at around 9-10 a.m. until lunch. After having lunch, I do my routine around the home. I have a daily sessions at 4 p.m and as soon as I finish that, my working day is typically over. In the evenings, I can go out or enjoy myself at home. I hit the bed at around 10 p.m.\n\nWhat is your ideal job?\n\nI think what I have now is ideal for me. I mean there is no pressure, or any boss or client yelling at me, I get to choose whether I wanna work with this client or not and how much I can work for a day, allowing me to fully organize my days and suit them perfectly to my needs."
    },
    {
      "url": "/speaking/part-1/your-job-and-studies/",
      "content": "Can you describe your job or studies?\n\nI am self-employed, meaning I work from home and complete my clients’ orders in a designated or agreed time. Then there is usually back and forth sending of the product, just to tweak it so that the client is happy about the service.\n\nCan you describe one of your typical days?\n\nI wake up early at around 4 a.m. Then I have a breakfast and work for a while as I find myself the most productive at this time of the day. I take a short nap at around 9-10 a.m. until lunch. After having lunch, I do my routine around the home. I have a daily sessions at 4 p.m and as soon as I finish that, my working day is typically over. In the evenings, I can go out or enjoy myself at home. I hit the bed at around 10 p.m.\n\nWhat is your ideal job?\n\nI think what I have now is ideal for me. I mean there is no pressure, or any boss or client yelling at me, I get to choose whether I wanna work with this client or not and how much I can work for a day, allowing me to fully organize my days and suit them perfectly to my needs."
    }
  ]