[
    {
      "id": "6ETFzkZYVOZTxN8YQUCa",
      "data": {
        "title": "Test  1",
        "markup": "<h2>Listening Part 2</h2><p class=\"paragraph\"> <b>You will hear a woman called Yvonne on a TV programme giving her opinion about children being punished at school. For questions 9-18, complete the sentenceswith a word or short phrase.</b> </p><p class=\"paragraph\"> <audio src=\"https://englishpracticetest.net/wp-content/uploads/2022/01/fce-practice-listening-test-15-part-2.mp3\" controls></audio&gt; </p><p class=\"paragraph\"> The strap was a long piece of leather made especially for (9) …………………………children’s palms. Today, children who misbehave at school seldom even get a(10) ………………………… . In the fifties, Yvonne was strapped for coming to school in(11) ………………………… . Yvonne thought the way she was disciplined at schools was(12) ………………………… and unfair. The members of the organisation P.O.P.P.I. all had(13) ………………………… . In 1979, because of P.O.P.P.I., (14) ………………………… made thestrap illegal. Yvonne describes her children as (15) ………………………… andirresponsible. Yvonne does not think her children understand (16) …………………………they are. She is now sorry that the government (17) ………………………… . She believesthat there would be less (18) ………………………… if the strap was still used.&nbsp; &nbsp;&nbsp; phrase.https://englishpracticetest.net/wp-content/uploads/2022/01/fce-practice-listening-test-15-part-2.mp3The strap was a long piece of leather made especially for (9) …………………………children’s palms. Today, children who misbehave at school seldom even get a(10) ………………………… . In the fifties, Yvonne was strapped for coming to school in(11) ………………………… . Yvonne thought the way she was disciplined at schools was(12) ………………………… and unfair. The members of the organisation P.O.P.P.I. all had(13) ………………………… . In 1979, because of P.O.P.P.I., (14) ………………………… made thestrap illegal. Yvonne describes her children as (15) ………………………… andirresponsible. Yvonne does not think her children understand (16) …………………………they are. She is now sorry that the government (17) ………………………… . She believesthat there would be less (18) ………………………… if the strap was still used.&nbsp; &nbsp;&nbsp; </p> <details><summary>Answers</summary><p>9 hitting </p> <p>10 telling off </p> <p>11 the wrong shoes </p> <p>12 (very) cruel </p> <p>13 young children </p> <p>14 the government </p> <p>15 lazy </p> <p>16 how lucky </p> <p>17 changed the law  18 (teenage) crime </p> <h3 id=\"audioscripts\">Audioscripts</h3> <p>Yvonne: Any of you who are of my generation or older will no doubt remember … the strap. But for those youngsters listening, I’d better explain because I’m saying this for your benefit. The strap, as they called it, was a thick piece of leather about an inch wide and half as long as a belt and it was especially designed for hitting small children, on the palms of their hands. Nowadays, if you do something wrong at school, you’re unlucky if you even get a telling off. And even the most serious offences get little more than a concerned phone call from the head teacher to your mum and dad. Now, when I was at St Anne’s School for Girls in the fifties, we didn’t have things quite so easy. It didn’t take much to get a strapping. I’ll never forget the first time it happened to me. One morning, I came to school in the wrong shoes – brown ones instead of black – and that was enough for the principal to call me up in front of the whole class of children and beat my hand until it bled. I saw this and many other examples of our school’s discipline system as very cruel and unfair. Now, unlike many people of that time, I didn’t just forget about it when my school days were over. Soon I had children of my own and the thought that they would one day get the same treatment, really made my blood boil … and that’s when I heard about P.O.P.P.I. … er … Parents Opposed to Physical Punishment of Infants. All the other members were like me. They had young children and didn’t want some unfeeling teachers filling their lives with misery. So we started writing letters. First, to the schools, then to the education department and eventually, to our local politicians, and in 1979, the government put an end to the strap … and to the cane … and to the paddle and we thought that we had guaranteed our children the chance to grow up into fine young people. And that, I’m afraid, did not happen. My own son and daughter have turned into lazy, irresponsible young adults who really have no idea how lucky they are. I’m sure you all know people like them … and they’re not the worst by far. </p></details>",
        "created_at": {
          "seconds": 1705390514,
          "nanoseconds": 448000000
        }
      }
    },
    {
      "id": "8Rw7SUWQneVkJossZgk7",
      "data": {
        "markup": "<div class=\"et_pb_text_inner\"><h3><strong><span style=\"font-size: large;\"><span style=\"font-size: x-large;\">Listening Part 5</span><br></span></strong></h3> <h3><span style=\"font-size: large;\"><strong></strong></span></h3> <p><span style=\"font-size: large;\">You will hear three different extracts. For questions <strong>1-6</strong>, choose the answer (<strong>A</strong>, <strong>B</strong> or <strong>C</strong>) which fits best according to what you hear. There are two questions for each extract.</span></p></div>             </div>              <audio src=\"https://englishpracticetest.net/wp-content/uploads/2021/11/cae-practice-listening-test-01-part-1.mp3\" controls></audio>  <div class=\"et_pb_text_inner\"><p><span style=\"font-size: large;\"><strong>Extract One</strong></span></p> <p><span style=\"font-size: large;\">You hear two neighbours, Adam and Juliet, talking about living in Montreal, Canada.</span></p> <p><span style=\"font-size: large;\"><strong>1</strong>&nbsp;&nbsp; What attracted Adam to living in Montreal?</span></p> <p><span style=\"font-size: large;\"><strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; A</strong>&nbsp;&nbsp; the change in weather from winter to summer</span></p> <p><span style=\"font-size: large;\"><strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; B</strong>&nbsp;&nbsp; the feeling of close community evident there</span></p> <p><span style=\"font-size: large;\"><strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; C</strong>&nbsp;&nbsp; the value inhabitants place on tradition</span></p> <p><span style=\"font-size: large;\"><strong>2</strong>&nbsp;&nbsp; What do they both say about accommodation in Montreal?</span></p> <p><span style=\"font-size: large;\"><strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; A</strong>&nbsp;&nbsp; The frequency with which people move house is above average.</span></p> <p><span style=\"font-size: large;\"><strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; B</strong>&nbsp;&nbsp; Central apartments are rarely available for purchase.</span></p> <p><span style=\"font-size: large;\"><strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; C</strong>&nbsp;&nbsp; Renting is a comparatively inexpensive option.</span></p></div>  <div class=\"et_pb_text_inner\"><p><span style=\"font-size: large;\"><strong>Extract Two</strong></span></p> <p><span style=\"font-size: large;\">You hear two students, a girl called Soraya and a boy called Halim, talking about an essay they have to write on the topic of plastic.</span></p> <p><span style=\"font-size: large;\"><strong>3</strong>&nbsp;&nbsp; What is Soraya doing?</span></p> <p><span style=\"font-size: large;\"><strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; A</strong>&nbsp;&nbsp; acknowledging the benefits of plastic as a material</span></p> <p><span style=\"font-size: large;\"><strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; B</strong>&nbsp;&nbsp; assessing the accuracy of information written about plastic</span></p> <p><span style=\"font-size: large;\"><strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; C</strong>&nbsp;&nbsp; clarifying reasons for a change in people’s attitudes to plastic</span></p> <p><span style=\"font-size: large;\"><strong>4</strong>&nbsp;&nbsp; What does Halim say about the documentary he saw?</span></p> <p><span style=\"font-size: large;\"><strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; A</strong>&nbsp;&nbsp; It failed to offer a balanced argument.</span></p> <p><span style=\"font-size: large;\"><strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; B</strong>&nbsp;&nbsp; It exaggerated the conclusions it drew.</span></p> <p><span style=\"font-size: large;\"><strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; C</strong>&nbsp;&nbsp; It omitted some significant points.</span></p></div>  <div class=\"et_pb_text_inner\"><p><span style=\"font-size: large;\"><strong>Extract Three</strong></span></p> <p><span style=\"font-size: large;\">You hear a psychologist, Dr Jane Blake, and a journalist, Ed Regas, discussing the teenage years.</span></p> <p><span style=\"font-size: large;\"><strong>5</strong>&nbsp;&nbsp; According to Dr Blake, what mistake do some parents make?</span></p> <p><span style=\"font-size: large;\"><strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; A</strong>&nbsp;&nbsp; They misinterpret their teenagers’ behaviour.</span></p> <p><span style=\"font-size: large;\"><strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; B</strong>&nbsp;&nbsp; They want to project their children for too long.</span></p> <p><span style=\"font-size: large;\"><strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; C</strong>&nbsp;&nbsp; They fail to recognise that their children’s needs have changed.</span></p> <p><span style=\"font-size: large;\"><strong>6</strong>&nbsp;&nbsp; Which aspect of adolescence particularly interests Ed Regas?</span></p> <p><span style=\"font-size: large;\"><strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; A</strong>&nbsp;&nbsp; the role played by gaming in teenagers’ lives</span></p> <p><span style=\"font-size: large;\"><strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; B</strong>&nbsp;&nbsp; teenagers’ abnormal sleep patterns</span></p> <p><span style=\"font-size: large;\"><strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; C</strong>&nbsp;&nbsp; the influence of peers on teenagers</span></p></div>   <details>     <summary> Answer &amp; Audioscript </summary>                 <div class=\"et_pb_toggle_content clearfix\" style=\"display: block;\"><p><span style=\"font-size: large;\"><strong>1 A</strong>&nbsp;&nbsp; B: Adam says he now has good friends in the community, but he doesn’t say this is what attracted him to Montreal. C: He mentions that he and his family love celebrating Canada Day, but he doesn’t say anything about the value other inhabitants put on celebrating that tradition.</span></p> <p><span style=\"font-size: large;\"><strong>2 C</strong>&nbsp;&nbsp; A: Although they both mention people who are moving away from their street, neither of them comments on the frequency with which people move house in Montreal. B: Only Juliet mentions that her sister would like to live in the city centre.</span></p> <p><span style=\"font-size: large;\"><strong>3 A</strong>&nbsp;&nbsp; B: Soraya says the opinions expressed in the press and journals now are very diﬀerent from earlier ones, but she doesn’t comment on their accuracy. C: She doesn’t attempt to explain or clarify why people have changed their opinions.</span></p> <p><span style=\"font-size: large;\"><strong>4 B</strong>&nbsp;&nbsp; A: Halim expresses the opposite opinion: ‘it did go into the pros and cons of the uses of plastic’. C: He also says that the documentary covered the significant points: ‘it covered the main ideas we’d discussed in class’.</span></p> <p><span style=\"font-size: large;\"><strong>5 B</strong>&nbsp;&nbsp; A: Jane says parents cope well with their teenage children’s moods, which suggests they do understand them. C: She also suggests that parents do recognise that their children’s needs have changed because they adapt to giving more emotional support.</span></p> <p><span style=\"font-size: large;\"><strong>6 A</strong>&nbsp;&nbsp; B: Ed mentions that his son is reluctant to wake up before ten, but this is not what particularly interests him. C: Although he is keen for his son to have a good circle of friends, he doesn’t say that he’s particularly interested in the influence of peers on teenagers.</span></p> <p><span style=\"font-size: large;\"><strong><em>Audioscript</em></strong></span></p> <p><span style=\"font-size: large;\"><strong><em>Extract One</em></strong></span></p> <p><span style=\"font-size: large;\"><em>Juliet</em>: Hi, Adam. How are you finding living in Montreal?</span></p> <p><span style=\"font-size: large;\"><em>Adam</em>: Hi, Juliet. It’s a great city and I’ve got some good buddies now, guys who live on our street and work colleagues. Are you going to the street party to celebrate Canada Day?</span></p> <p><span style=\"font-size: large;\"><em>Juliet</em>: You bet. It’s a real important thing for me and my family; celebrating it is an annual ritual for us.</span></p> <p><span style=\"font-size: large;\"><em>Adam</em>: I’ll see you there then; it’s going to be a beautiful day. <u>That sudden shift from biting cold gales to beautifully balmy evenings when you can sit outside in a T-shirt until midnight is what drew me to Montreal</u>. It’s awesome!</span></p> <p><span style=\"font-size: large;\"><em>Juliet</em>: I know what you mean. So are you staying on in your apartment? I think you said you only leased it for a year?</span></p> <p><span style=\"font-size: large;\"><em>Adam</em>: Yeah. It makes sense to rent in Montreal – <u>you don’t have to fork out a fortune for a place downtown</u>.</span></p> <p><span style=\"font-size: large;\"><em>Juliet</em>: <u>You can get a deal</u> because there’s so much on the market.</span></p> <p><span style=\"font-size: large;\"><em>Adam</em>: And getting a place of my own is, well, financially out of the question. But quite a few people on our street are moving out, right?</span></p> <p><span style=\"font-size: large;\"><em>Juliet</em>: Yeah, like my sister’s moving again. She wants to be more in the centre.</span></p> <p><span style=\"font-size: large;\"><em>Adam</em>: Oh, OK.</span></p> <p><span style=\"font-size: large;\"><strong><em>Extract Two</em></strong></span></p> <p><span style=\"font-size: large;\"><em>Halim</em>: Hi, Soraya, how are you getting on with your essay on plastic?</span></p> <p><span style=\"font-size: large;\"><em>Soraya</em>: Hi, Halim. Well, the background reading’s fascinating. OK, there’s been a complete U-turn in the views expressed in journals and even in the popular press in recent years. But actually, <u>when I read about the 1950s, I get that at that time plastic was seen as revolutionary. You could make anything from it, from bottles to roofs; it was so strong and durable. What was not to like?</u> Whereas now, it’s seen as a real threat to the planet.</span></p> <p><span style=\"font-size: large;\"><em>Halim</em>: Yeah. I’ve read a couple of really thought-provoking articles and I watched the documentary our tutor recommended, you know the one called <em>Plastic Madness</em>.</span></p> <p><span style=\"font-size: large;\"><em>Soraya</em>: Oh yeah, any good?</span></p> <p><span style=\"font-size: large;\"><em>Halim</em>: <u>Wildly over-dramatic at the end</u>, in my view. To be fair, it did go into the pros and cons of the uses of plastic, and it covered the main ideas we’d discussed in class, but <em>to close with statements like Most species of fish will be extinct within ten years was way over the top</em>.</span></p> <p><span style=\"font-size: large;\"><em>Soraya</em>: And did it go into issues like plastic causing air pollution?</span></p> <p><span style=\"font-size: large;\"><em>Halim</em>: It did, yeah.</span></p> <p><span style=\"font-size: large;\"><strong><em>Extract Three</em></strong></span></p> <p><span style=\"font-size: large;\"><em>Ed</em>: So, Jane, I’m the parent of a sixteen-year-old, Max, and my wife and I are constantly wondering if we’re doing the right thing.</span></p> <p><span style=\"font-size: large;\"><em>Jane</em>: The teenage years are critical in human development, Ed. <u>Parents are programmed to care for their child</u>, but in evolutionary terms, the infant must develop, mature and eventually separate from them. And although the majority of parents cope admirably with their child becoming a monosyllabic and at times diﬀicult teenager, <u>few know when to let go</u>. At the same time, parents do generally adapt well to having to provide more emotional support than physical support.</span></p> <p><span style=\"font-size: large;\"><em>Ed</em>: With Max, we’re going through things like, he seems reluctant to wake up before ten.</span></p> <p><span style=\"font-size: large;\"><em>Jane</em>: Some schools have changed their timetable to take into account the fact that teenagers perform better later in the day.</span></p> <p><span style=\"font-size: large;\"><em>Ed</em>: Not his, unfortunately. The good thing is <u>Max and I are both seriously into gaming and I’m fascinated by how so many games promote universal values</u> like hard work pays oﬀ, collaboration works better than confrontation and thinking things through is to be admired. I encourage Max to invite his mates round to our house because I want him to build up a circle of good friends who share common interests.</span></p></div>             </div>             </div>  </details> </div>",
        "title": "Test 2",
        "created_at": {
          "seconds": 1705384198,
          "nanoseconds": 224000000
        }
      }
    },
    {
      "id": "AuD8jCZhcmwd6OK2sLYU",
      "data": {
        "title": "Map ",
        "created_at": {
          "seconds": 1705406277,
          "nanoseconds": 313000000
        },
        "markup": "<audio src=\"https://kananco-assests.s3.ap-south-1.amazonaws.com/audio/listening/ielts-listening-map.mp3\" controls></audio><figure class=\"fig-img\"><img class=\"img   \" src=\"https://websitecmscdn.s3.ap-south-1.amazonaws.com/ielts_listening_map_4557061590.png?updated_at=2022-11-22T06:35:56.028Z\" alt=\"map\"><figcaption class=\"fig-cap\"></figcaption></figure><p class=\"paragraph\"> &nbsp; 1.&nbsp;Nursery _____________ </p><p class=\"paragraph\"> 2.&nbsp;Native tree zone ____________ </p><p class=\"paragraph\"> 3.&nbsp;Exotic forest zone __________ </p><p class=\"paragraph\"> 4.&nbsp;Exhibition ____________ </p><p class=\"paragraph\"> 5.&nbsp;Shamiana _________________&nbsp; &nbsp; &nbsp; </p><p class=\"paragraph\"> 6.&nbsp;Topiary display ____________ </p> <details> <summary>Transcript</summary> Answers<br> 1. C 2. D 3. G 4. J 5. K 6. B <h2>Transcript</h2> Good morning and welcome to the National Botanical Gardens. I am your guide, Lisa, for the garden tour. This garden is a step closer towards the conservation of indigenous trees that are essential to the regional vegetation. Since it is a planned project, it also becomes a useful centre for research on the conservation of plant species. Actually, this region is too big to be called a garden. It covers about 30 hectares of land which is protected by the Central Forest Service Management of the country.  As you can see in this map, there are no concrete structures anywhere in this area, you’ll see only landscapes and narrow paths lightly cleared for walking. These special pathways are called the Garden Walks. We are here at the Botanical Garden Office and there’s an L-shape garden walk from here right up to the Forest Zone. The first square section on the left is the (Q1) Nursery with saplings of some of the most exotic plants and trees. You can buy everything you like when we complete the tour. From here we&#39;ll be walking the track to the two forest areas that have the native trees and smaller plants that are used for landscaping the local urban areas. The (Q2) Native Tree Zone is here, immediately behind the Nursery, and next to it is the Nonnative Trees Zone. We are now looking at the huge fenced area on the west. You can see an area with fencing; this is the (Q3) Exotic Forest Zone. Several species of vegetation and insects that breed in this land will be destroyed or lose their habitat due to trampling by visitors. So entry is allowed for researchers only. There’s a smaller garden walk, going up north beyond the fencing. It leads to the Research Centre, which is built of eco-friendly construction material, has natural heating and cooling technology and uses solar energy. This building is not open to visitors. But we will visit the (Q4) Exhibition in the smaller extension of this building, not the larger one. It has a separate entrance within the research centre. We will see a short documentary on the importance of forest conservation followed by a talk by an expert on how you can contribute to tree conservation. After we tour the nursery and the exhibition in the research centre, we will gather in the (Q5) Shamiana for lunch. It’s on the left as we head back to the garden office. Meals in the open are a unique experience, and I am sure you will enjoy it. After lunch, we will head to the main entrance. To the left, you will see a circular garden with a display of colourful ornamental plants. On the other side of this garden walk, there is a beautiful (Q6) Topiary Display. You’ll get to see the topiarists at work trimming plants into various shapes of birds, animals and other objects. This garden walk connects the botanical garden to the village nearby. Most workers are local and use this pathway. But it is also open for morning walkers or visitors who want to have a glimpse of the rural life around. You will be paying for your purchases here at the garden office as we exit the premises (fade).   </details>"
      }
    },
    {
      "id": "Djj2Xs2YKTQNMG5yEcF5",
      "data": {
        "title": "Test 3",
        "created_at": {
          "seconds": 1705384568,
          "nanoseconds": 210000000
        },
        "markup": "<p>You will hear three different extracts. For questions <strong>1-6</strong>, choose the answer (<strong>A</strong>, <strong>B</strong> or <strong>C</strong>) which fits best according to what you hear. There are two questions for each extract.</p> <audio controls src=\"https://englishpracticetest.net/wp-content/uploads/2021/11/cae-practice-listening-test-02-part-1.mp3\"></audio>    <p><strong>Extract One</strong></p> <p>You hear Nathalie and her brother David talking about thriller movies.</p> <p><strong>1</strong>   What is Nathalie surprised to read about thriller movies?</p> <p><strong>A</strong>   that very logical people tend to prefer them</p> <p><strong>B</strong>   that families who enjoy watching them together are happiest</p> <p><strong>C</strong>   that when we watch them, our bodies produce a chemical</p> <p><strong>2</strong>   David thinks watching horror movies is similar to going on a short holiday because both activities</p> <p><strong>A</strong>   allow people to escape everyday problems.</p> <p><strong>B</strong>   make people feel emotionally stronger.</p> <p><strong>C</strong>   stimulate people’s creativity.</p> <p><strong>Extract Two</strong></p> <p>You hear two architecture students discussing covered overhead walkways called ‘city skyways’.</p> <p><strong>3</strong>   What do they agree about trends in shopping?</p> <p><strong>A</strong>   Skyways have led to a decline in the summer of city-centre shops.</p> <p><strong>B</strong>   Out-of-town shopping malls are less popular nowadays.</p> <p><strong>C</strong>   Increased deliveries from online shopping will cause problems.</p> <p><strong>4</strong>   What does the man think is the greatest advantage of skyways?</p> <p><strong>A</strong>   They are climate-controlled.</p> <p><strong>B</strong>   They are safe areas for pedestrians.</p> <p><strong>C</strong>   They are a solution to overcrowded streets.</p> <p><strong>Extract Three</strong></p> <p>You hear a radio discussion in which two educationalists, Sophia Lee and Gary Cole, are talking about sport.</p> <p><strong>5</strong>   Gary would like to raise public awareness of how sport contributes to</p> <p><strong>A</strong>   a child’s social development.</p> <p><strong>B</strong>   a child’s physical health and growth.</p> <p><strong>C</strong>   a child’s understanding of the need for rules.</p> <p><strong>6</strong>   Sophia says that children who do sport are more likely to</p> <p><strong>A</strong>   go on to further education.</p> <p><strong>B</strong>   have a good school attendance record.</p> <p><strong>C</strong>   be motivated to succeed academically.</p> <details> <summary>Answer &amp; Audioscript</summary>  <strong>1 B</strong>   A: This is Nathalie’s own observation, not something she’s read and been surprised by. C: This is information that Nathalie has heard before – it doesn’t surprise her.  <strong>2 C</strong>   A: David says watching horror movies helps people find solutions to work problems. B: He talks about feeling excited about possibilities, but this doesn’t match B.  <strong>3 A</strong>   B: Only the woman mentions out-of-town malls, and she doesn’t say they are less popular now. C: Only the woman talks about online shopping deliveries.  <strong>4 C</strong>   ‘But to my mind, getting people away from congested roads and pavements has to be the winning argument’ tells us that A and B are not ‘the greatest advantage’.  <strong>5 A</strong>   B: Gary explains that there has already been a public awareness campaign about this. C: He says he’d rather not focus on rules.  <strong>6 C</strong>   A: Sophie’s first study covered students at university level, but she doesn’t say that people are more likely to go to university if they do sport. B: Sophie tracked students’ attendance in her first study, but she doesn’t draw this conclusion.  <strong><em>Audioscript</em></strong>  <strong><em>Extract One</em></strong>  <em>Nathalie</em>: David, have you read this article about watching thriller movies?  <em>David</em>: No, is it good?  <em>Nathalie</em>: Yeah, well, I’d heard before that when we’re scared, our brains pump out the feel-good chemical dopamine, like when we’re in love with someone. But look at this: it says that families who like nothing better than sitting together on the sofa in front of a good thriller movie are the most contented. That’s news to me! Most people I know who adore thriller movies, appreciate them for the really good plot lines. You know, the stories are so rational in many ways that some otherwise very sensible people are drawn into them.  <em>David</em>: For me, when I watch horror movies, it’s like going on a mini vacation.  <em>Nathalie</em>: Do you mean you can wander oﬀ into a fantasy world?  <em>David</em>: More that it gives me ideas, even about how to solve issues at work. And I’ve heard other people say the same.  <em>Nathalie</em>: Really? I could understand it if you said something like it’s the suspense, the special eﬀects or the thrill you get from watching them.  <em>David</em>: Well, it may sound odd, but they leave me feeling more excited about possibilities to do with daily life.  <strong><em>Extract Two</em></strong>  <em>Woman</em>: I’ve just been reading an article about building skyways in cities. Their eﬀect on commerce, particularly shopping, can be considerable because when they link the upper floors of buildings, shops at ground level don’t get passing trade any more. Some even go bust.  <em>Man</em>: Absolutely. If people are walking about on the third or fourth floor, they won’t make a special trip down to the ground level to buy something, and that’s why so many stores are having to close, even when they’re in prime central locations.  <em>Woman</em>: I read they’re also struggling because people are buying online. And with online shopping, deliveries are becoming more eﬀicient. Plus centres are suﬀering because all those large shopping malls on the outskirts of towns were built to attract people by oﬀering a range of activities, like movie theatres.  <em>Man</em>: I think the two things are diﬀerent. But you know the arguments – skyways mean pedestrians can enjoy walking through a city in any weather, and there’s less crime than at street level. But, to my mind, getting people away from congested roads and sidewalks has to be the winning argument. Skyways have the potential to bring life back to city centres. After all, the centre is where people not only want to shop and work, but live too.  <strong><em>Extract Three</em></strong>  <em>Sophie</em>: So, Gary, you’re working on public information campaigns, aren’t you?  <em>Gary</em>: Yes, Sophie, I’m actually employed by the government and the thinking behind the public awareness campaigns this year is all about encouraging participation in sports at school.  <em>Sophie</em>: Yes, I saw the very successful TV campaign showing the importance of doing sport for healthy growth in primary-aged children. But isn’t that something that the public already knows?  <em>Gary</em>: Most people, yes, and that’s why we started with the health aspect. What’s less well understood, and what I want to get across, is how sport helps children mature socially by teaching them about teamwork and about fair play. I’d rather not focus on the discipline aspect – the idea that sports are all about learning sets of rules and sticking to them.  <em>Sophie</em>: Interesting. I’m looking into the eﬀect of sport on learning performance. My first study followed a group of children from primary school right through to university level. I tracked various things like how often they were absent through illness, and their grades, and what stood out was that those who did sport were much keener to try to get good grades in maths, English, those kinds of subjects.  <em>Gary</em>: And did they achieve that?  <em>Sophie</em>: Not always, but the aspiration was there. And for me, that’s what really counts. </details>"
      }
    },
    {
      "id": "V8awbi4PyUeq1Y1hAPNi",
      "data": {
        "title": "Test 4",
        "markup": "<p>You will hear five short extracts in which business people are talking about the future of work.</p> <audio controls src=\"https://englishpracticetest.net/wp-content/uploads/2021/11/cae-practice-listening-test-02-part-4.mp3\"></audio>   <p><strong>TASK ONE</strong></p> <p>For questions <strong>21-25</strong>, choose from the list (<strong>A-H</strong>) the focus of each person’s research into the future of work.</p> <p><strong>While you listen you must complete both tasks.</strong></p> <p><strong>A</strong>   the social aspect of work</p> <p><strong>B</strong>   the customers’ perspective</p> <p><strong>C</strong>   the standard of living</p> <p><strong>D</strong>   communications</p> <p><strong>E</strong>   job satisfaction</p> <p><strong>F</strong>   globalisation</p> <p><strong>G</strong>   business and ecology</p> <p><strong>H</strong>   a historical comparison</p> <p><strong>21</strong>   Speaker 1</p> <p><strong>22</strong>   Speaker 2</p> <p><strong>23</strong>   Speaker 3</p> <p><strong>24</strong>   Speaker 4</p> <p><strong>25</strong>   Speaker 5</p> <p><strong>TASK TWO</strong></p> <p>For questions <strong>26-30</strong>, choose from the list (<strong>A-H</strong>) the prediction each person makes about work.</p> <p><strong>A</strong>   More jobs will be done by machines.</p> <p><strong>B</strong>   The cost of manufacturing will fall.</p> <p><strong>C</strong>   Cities will continue to attract workers.</p> <p><strong>D</strong>   People will retire later than at present.</p> <p><strong>E</strong>   More people will work for themselves.</p> <p><strong>F</strong>   Trust in large companies will decrease.</p> <p><strong>G</strong>   Leadership will be a more democratic process.</p> <p><strong>H</strong>   Ongoing learning will become more common.</p> <p><strong>26</strong>   Speaker 1</p> <p><strong>27</strong>   Speaker 2</p> <p><strong>28</strong>   Speaker 3</p> <p><strong>29</strong>   Speaker 4</p> <p><strong>30</strong>   Speaker 5</p> <details> <summary>Answer &amp; Audioscript</summary>  <strong><em>Task One</em></strong>  <strong>21 D</strong>   ‘to find out how many face-to-face meetings we have compared to video conferencing’ reflects D. Some questions in the questionnaire were about customer care, but B was not the main focus of the research.  <strong>22 E</strong>   ‘For my Master’s degree, I looked into how happy people who worked without a boss were’ reflects E. Although the speaker makes the point that some self-employed people weren’t living in luxury, C was not the focus of the research.  <strong>23 B</strong>   ‘I’ve been carrying out interviews with shoppers for a paper I’m writing’ reflects B. Although there is mention of companies saying they want to help save the planet, G is not the focus of the research.  <strong>24 G</strong>   ‘At present, I’m involved in a study examining the carbon footprint of trade’ reflects G. Although the speaker mentions consumers, B is not the focus of the research.  <strong>25 A</strong>   ‘[I’ve] been looking into how, as more people live on their own and families get smaller, the workplace takes on more importance as a place to make friends’ reflects A.  <strong><em>Task Two</em></strong>  <strong>26 H</strong>   ‘the need for continued education is going to feature more prominently in the workplace’ reflects H.  <strong>27 E</strong>   ‘The trend is definitely for people to set up their own small business and work from home’ reflects E.  <strong>28 F</strong>   ‘Any confidence people ever had in big business is going to evaporate over the next few years’ reflects F. Although the speaker mentions a company having financial diﬀiculties, B is not the prediction that she makes.  <strong>29 C</strong>   ‘And the attraction of an urban environment for workers I’m sure will be powerful for many years to come’ reflects C. The speaker mentions how long he has been in business but D is not predicted.  <strong>30 D</strong>   ‘I’d say we’ll all be in work well into our 70s, rather than 50s or 60s as is the current norm’ reflects D. Although the speaker mentions people who work at home, E is not a prediction she makes about them.  <strong><em>Audioscript</em></strong>  <strong><em>Speaker 1</em></strong>  I’ve just got the results of a questionnaire which I sent out to my company’s oﬀices in eight countries. Some questions touched on customer care and how ‘green’ we are, but the main thrust of the questions was to find out how many face to-face meetings we have compared to video conferencing and how people think this will change over the next five years. And, while some fears were expressed about automation and any resulting unemployment, it was clear that people were very keen to keep themselves up to date with the latest technology. I have no doubt that with the fast pace of change that we’re seeing, the need for continued education is going to feature more prominently in the workplace.  <strong><em>Speaker 2</em></strong>  As I’m still only in my 20s, and in my first job ever, I’m aware that by working in a range of diﬀerent companies I’ll build up useful business experience. Like so many other people of my generation, I can’t see myself working for large companies for long. The trend is definitely for people to set up their own small business and work from home. Having no boss sounds good! For my Master’s degree I looked into how happy people who worked without a boss were, and they had more motivation, felt more sense of achievement and were more proud of what they did compared with oﬀice workers, even if they weren’t living in luxury.  <strong><em>Speaker 3</em></strong>  I’ve just been reading about the latest financial scandal to hit a large enterprise – it’s not the first and, in my view, it won’t be the last. And this is only the tip of the iceberg. Any confidence people ever had in big business is going to evaporate over the next few years. The value of the company has plummeted, unsurprisingly. I’ve been carrying out interviews with shoppers for a paper I’m writing for a business journal, and people are smart, they see through propaganda that companies send out saying how they’re helping save the planet! Companies have to realise they only have a business if people buy their stuﬀ!  <strong><em>Speaker 4</em></strong>  I’ve been in business for over 40 years and will be retiring soon. I’ve seen many changes. For one thing, the way management treat people has improved. Workers get much more of a say now. But some things remain the same – the attraction of an urban environment for workers, I’m sure will be powerful for many years to come. This sort of centralisation makes sense. At present, I’m involved in a study examining the carbon footprint of trade. It’s imperative that companies take responsibility, and also consumers. I mean, how many people really think about food air miles or where their latest gadget was made? We’ll be publishing our findings in the next couple of months.  <strong>Speaker 5</strong>  I give lectures at a business school and have been looking into how, as more people live on their own and families get smaller, the workplace takes on more importance as a place to make friends. We can’t underestimate the value of belonging to an organization from the employee’s personal point of view. Loneliness among the elderly, in particular, can be a problem, but if I were to make an educated guess, I’d say we’ll all be in work well into our 70s, rather than 50s or 60s as is the current norm, and that may go some way to solving the problem. Of course, those who have chosen to work at home may miss out on this benefit.  </details>",
        "created_at": {
          "seconds": 1705387882,
          "nanoseconds": 296000000
        }
      }
    },
    {
      "id": "rHSvEpNr0oPzoF7Tji1G",
      "data": {
        "title": "Test 5",
        "markup": "<p>You will hear a citrus fruit grower, called Ben Tyrell, giving a presentation to students. For questions <strong>7-14</strong>, complete the sentences with a word or short phrase.</p> <audio controls src=\"https://englishpracticetest.net/wp-content/uploads/2021/11/cae-practice-listening-test-01-part-2.mp3\"></audio>   <p><strong>CITRUS FRUIT FARMER</strong></p> <p>Ben has an organic farm, so he relies primarily on (<strong>7</strong>) …………………………… to assess the health of his trees.</p> <p>If the (<strong>8</strong>) …………………………… of a tree are the wrong colour, the tree usually requires fertiliser.</p> <p>When to give trees fertiliser is determined principally by the (<strong>9</strong>) …………………………… .</p> <p>To control fungi on the fruit, Ben uses (<strong>10</strong>) …………………………… as an organic fungicide.</p> <p>Ben only worries about weeds if they are growing near his (<strong>11</strong>) …………………………… system.</p> <p>The (<strong>12</strong>) …………………………… of the fruit is the last criterion to check before picking begins.</p> <p>The only tool fruit pickers use is (<strong>13</strong>) ……………………………, otherwise fruit may be damaged.</p> <p>Ben uses the phrase ‘(<strong>14</strong>) ……………………………’ to describe what he aims to teach school children.</p> <details> <summary>Answer &amp; Audioscript</summary>   <strong>7 observation</strong>   Synthetic pesticides are mentioned, but Ben doesn’t use them, and he says that observation is more important than the protection of young trees.  <strong>8 leaves</strong>   Bark is also mentioned, but it’s when leaves are discoloured that the tree needs fertiliser.  <strong>9 weather</strong>   Two factors are mentioned, but the weather is more important than the delivery dates.  <strong>10 bacteria</strong>   Other farmers use soap, but he doesn’t.  <strong>11 irrigation</strong>   Although he mentions grass mowers and a shed, these are not systems and don’t fit with the meaning of the sentence.  <strong>12 size</strong>   He checks the levels of sugar and juice, but the sentence is about what he does last.  <strong>13 scissors</strong>   Ladders and metal baskets are also mentioned, but Ben and his workers don’t use them.  <strong>14 touch</strong> <strong>the earth</strong>   He also uses the term ‘intelligent food choices’, but this doesn’t fit the meaning of the sentence.  <strong><em>Audioscript</em></strong>  <em>Ben</em>: Hi, I’d like to tell you a bit about myself and my work as a citrus fruit farmer. My name’s Ben Tyrell and my family’s been growing oranges, lemons and grapefruit for several generations. As an organic grower, I don’t use synthetic pesticides on our farm, so to ensure all the trees are healthy, observation becomes that much more important; even more important than, for example, the protection of young trees. If a tree needs fertiliser, there’ll be discoloration of the leaves rather than the bark. When a tree’s oﬀ-colour, it might be because it’s running low on potassium or nitrogen. Deciding <em>when</em> to start putting some organic fertiliser on the trees has to be carefully calculated. It’ll depend partly on the deadlines for delivering the fruit to the packing house, but mainly on the weather. Do it at the wrong time and its eﬀiciency is greatly reduced.  In springtime, my day will also include checking the fungus situation on the fruit on the trees. At this time of year, we’re mainly concerned with the fungi Alternaria and Melanose. While harmless, if the fruit has either of these fungi, it’ll have blemishes and that’d put our fruit into a lower grade at the packing house. So, if we find any fungi, I use bacteria to attack and control the fungi as an organic solution to the problem. Some growers use a type of soap made from organic fats, but not me.  During the summer, weeds start growing up around the trees. We’re completely against using any sort of chemicals as a weed killer and I guess our neighbours might think our farm looks a bit messy, but I don’t get hung up about weeds. The only time we do something about them is when they start appearing right next to the irrigation setup. Then we might use small grass mowers that we keep in a shed to control the weeds.  In late fall, harvest time, I begin to check if the fruit’s ready to pick. In the US, there are state regulations for when to pick fruit. We have to check that the fruit contains certain levels of sugar and juice. After meeting these requirements, finally, we’ll look at size because there are regulations for that as well. So, when we’re sure the fruit is ready, we call in the pickers. All the fruit’s picked by hand – our workers use scissors so that we don’t damage the fruit. We don’t use ladders or metal baskets for the same reason.  I love growing organically and knowing that the fruit we produce is as healthy as it can be. We do tours of the farm for school kids because I’m keen that future generations can ‘touch the earth’, if you know what I mean. They can make what we call ‘intelligent food choices’, based on the knowledge of how a food was grown, how it was processed and how it was stored.  Now, any questions … </details>",
        "created_at": {
          "seconds": 1705389392,
          "nanoseconds": 194000000
        }
      }
    },
    {
      "id": "test-6",
      "data": {
        "markup": "<p>You will hear five short extracts in which young writers are talking about one of their books winning a competition.</p> <audio controls src=\"https://englishpracticetest.net/wp-content/uploads/2021/11/cae-practice-listening-test-01-part-4.mp3\"></audio>   <p><strong>TASK ONE</strong></p> <p>For questions <strong>21-25</strong>, choose from the list (<strong>A-H</strong>) how each person left when they entered the competition.</p> <p><strong>While you listen you must complete both tasks.</strong></p> <p><strong>A</strong>   hopeful of winning the cash prize</p> <p><strong>B</strong>   terrified at making a speech</p> <p><strong>C</strong>   convinced they would not win</p> <p><strong>D</strong>   amused by the reactions of friends</p> <p><strong>E</strong>   unhappy with the competition rules</p> <p><strong>F</strong>   worried about coping with failure</p> <p><strong>G</strong>   impressed by the other books</p> <p><strong>H</strong>   determined to learn from the experience</p> <p><strong>21</strong>   Speaker 1</p> <p><strong>22</strong>   Speaker 2</p> <p><strong>23</strong>   Speaker 3</p> <p><strong>24</strong>   Speaker 4</p> <p><strong>25</strong>   Speaker 5</p> <p><strong>TASK TWO</strong></p> <p>For questions <strong>26-30</strong>, choose from the list (<strong>A-H</strong>) the main consequence for each person of winning the competition.</p> <p><strong>A</strong>   offers from overseas publishers</p> <p><strong>B</strong>   a change in writing style</p> <p><strong>C</strong>   opportunities to travel</p> <p><strong>D</strong>   contact with readers</p> <p><strong>E</strong>   difficulties finding inspiration</p> <p><strong>F</strong>   media intrusion</p> <p><strong>G</strong>   increased sales of previous work</p> <p><strong>H</strong>   a boost to confidence</p> <p><strong>26</strong>   Speaker 1</p> <p><strong>27</strong>   Speaker 2</p> <p><strong>28</strong>   Speaker 3</p> <p><strong>29</strong>   Speaker 4</p> <p><strong>30</strong>   Speaker 5</p> <details> <summary>Answer &amp; Audioscript</summary>  <strong>21 G</strong>   ‘a gripping read and well written’ reflects G. A may be tempting, but it’s wrong because it’s not how she felt when she entered the competition.  <strong>22 H</strong>   ‘it’d give me the chance to get feedback on my work and I’d take it on board’ reflects H. C is wrong because he had no convictions about whether he would win or not: ‘whatever the result, win or lose’.  <strong>23 F</strong>   ‘I had numerous sleepless nights thinking: what’ll happen if I don’t win?’ reflects F.  <strong>24 B</strong>   ‘I knew there’d be a big formal dinner and the winner would have to get up and come out with words of wisdom and the thought made me feel numb with fear!’ reflects B. C is wrong because ‘At that stage I had no idea whether I’d even win or not.’  <strong>25 E</strong>   ‘I was so hacked oﬀ by all the criteria I had to meet for the competition’ reflects E. D is wrong because ‘funny’ refers to the amusement she feels now, not when she entered the competition and not in response to the reactions of friends.  <strong>Task Two</strong>  <strong>26 G</strong>   ‘bookshops were overwhelmed with readers suddenly wanting anything and everything I’d ever written’ reflects G. D is wrong because it was her agent who dealt with fans’ emails.  <strong>27 B</strong>   ‘the mental switch I made from writing novels based on historical facts to more descriptive, character-driven stories‘ reflects B. C is wrong because he was travelling when he heard that he’d won the competition.  <strong>28 E</strong>   ‘I spent hours staring at a blank screen’ reflects E. F is wrong because she says that being ‘headline news’ was ‘great’, not an intrusion.  <strong>29 A</strong>   ‘I was being asked to write a follow-up novel by companies in countries I knew little about’ reflects A. B is wrong because there is no mention of him travelling to these countries, and G is wrong because the market interest was in a new novel, not his previous work.  <strong>30 H</strong>   ‘Winning has also made me a more assertive person, sure enough of myself to say …’ reflects H.  <strong><em>Audioscript</em></strong>  <strong><em>Speaker 1</em></strong>  I was thrilled when I heard I’d won first prize – a substantial amount of money! I’d had a sneaky look at all the novels that had been entered and I must admit every single one was a gripping read and well written. The ironic thing about winning the money was that I needed it less after I’d won. I’d spent a couple of years earning enough to live on, but not exactly living the high life. Then, once news was out about me winning, bookshops were overwhelmed with readers suddenly wanting anything and everything I’d ever written! Thankfully, my agent dealt with the emails that flooded in from fans and she also managed my social media presence.  <strong><em>Speaker 2</em></strong>  I live in Australia and I was on a flight back from Europe when the news broke, so I’d no idea I’d won the competition until the next day. Sure, I remember the publicity that surrounded winning, but what marked the event for me was the mental switch I made from writing novels based on historical facts to more descriptive, character-driven stories. I also recall, when I’d just sent oﬀ the entry form, thinking whatever the result, win or lose, it’d give me the chance to get feedback on my work and I’d take it on board. The judges were all highly respected writers and publishers, and even if they’d poured scorn on my work, it’d still have been useful.  <strong><em>Speaker 3</em></strong>  Well, to be honest, winning the prize has been a double-edged sword. Yeah, it was great to be headline news, but after that all died down, I spent hours staring at a blank screen thinking – what now? Obviously, I knew I was a good writer, I wouldn’t have won otherwise, but it was hard for about a year. It’s weird, because when I went in for the competition I had numerous sleepless nights thinking: what’ll happen if I don’t win? Would I go into some sort of decline and not want to face my friends and colleagues? Fortunately, I did win, so those anxieties never had to be faced.  <strong><em>Speaker 4</em></strong>  The minute I’d completed the form to enter the competition, the only thing I could think about was: what would I say when I accepted the prize? At that stage I had no idea whether I’d even win or not. I knew there’d be a big formal dinner and the winner would have to get up and come out with words of wisdom and the thought made me feel numb with fear! Anyway, I managed to mumble thanks to all my readers and the usual stuﬀ when the time came. In contrast, afterwards there was no time to think at all – I was being asked to write a follow-up novel by companies in countries I knew little about!  <strong><em>Speaker 5</em></strong>  I was so hacked oﬀ by all the criteria I had to meet for the competition that by the time I’d checked this, that and the other, sent endless confirmations of my ID, and read the competition style guide for the tenth time, I hoped I’d have nothing more to do with it all. Of course, having won, I can now see the funny side of all that. Winning has also made me a more assertive person, sure enough of myself to say, ‘No thank you, I won’t be doing that interview or attending that party.’ The same’s happened as far as writing goes – I know what works for me! </details>",
        "created_at": {
          "seconds": 1705404230,
          "nanoseconds": 744000000
        },
        "title": "Test 6"
      }
    },
    {
      "id": "test-7",
      "data": {
        "created_at": {
          "seconds": 1705404247,
          "nanoseconds": 867000000
        },
        "markup": "<p>You will hear three different extracts. For questions <strong>1-6</strong>, choose the answer (<strong>A</strong>, <strong>B</strong> or <strong>C</strong>) which fits best according to what you hear. There are two questions for each extract.</p> <audio src=\"https://englishpracticetest.net/wp-content/uploads/2021/11/cae-practice-listening-test-01-part-1.mp3\" controls></audio>    <p><strong>Extract One</strong></p> <p>You hear two neighbours, Adam and Juliet, talking about living in Montreal, Canada.</p> <p><strong>1</strong>   What attracted Adam to living in Montreal?</p> <p><strong>A</strong>   the change in weather from winter to summer</p> <p><strong>B</strong>   the feeling of close community evident there</p> <p><strong>C</strong>   the value inhabitants place on tradition</p> <p><strong>2</strong>   What do they both say about accommodation in Montreal?</p> <p><strong>A</strong>   The frequency with which people move house is above average.</p> <p><strong>B</strong>   Central apartments are rarely available for purchase.</p> <p><strong>C</strong>   Renting is a comparatively inexpensive option.</p> <p><strong>Extract Two</strong></p> <p>You hear two students, a girl called Soraya and a boy called Halim, talking about an essay they have to write on the topic of plastic.</p> <p><strong>3</strong>   What is Soraya doing?</p> <p><strong>A</strong>   acknowledging the benefits of plastic as a material</p> <p><strong>B</strong>   assessing the accuracy of information written about plastic</p> <p><strong>C</strong>   clarifying reasons for a change in people’s attitudes to plastic</p> <p><strong>4</strong>   What does Halim say about the documentary he saw?</p> <p><strong>A</strong>   It failed to offer a balanced argument.</p> <p><strong>B</strong>   It exaggerated the conclusions it drew.</p> <p><strong>C</strong>   It omitted some significant points.</p> <p><strong>Extract Three</strong></p> <p>You hear a psychologist, Dr Jane Blake, and a journalist, Ed Regas, discussing the teenage years.</p> <p><strong>5</strong>   According to Dr Blake, what mistake do some parents make?</p> <p><strong>A</strong>   They misinterpret their teenagers’ behaviour.</p> <p><strong>B</strong>   They want to project their children for too long.</p> <p><strong>C</strong>   They fail to recognise that their children’s needs have changed.</p> <p><strong>6</strong>   Which aspect of adolescence particularly interests Ed Regas?</p> <p><strong>A</strong>   the role played by gaming in teenagers’ lives</p> <p><strong>B</strong>   teenagers’ abnormal sleep patterns</p> <p><strong>C</strong>   the influence of peers on teenagers</p> <details> <summary>Answer &amp; Audioscript</summary>   <strong>1 A</strong>   B: Adam says he now has good friends in the community, but he doesn’t say this is what attracted him to Montreal. C: He mentions that he and his family love celebrating Canada Day, but he doesn’t say anything about the value other inhabitants put on celebrating that tradition.  <strong>2 C</strong>   A: Although they both mention people who are moving away from their street, neither of them comments on the frequency with which people move house in Montreal. B: Only Juliet mentions that her sister would like to live in the city centre.  <strong>3 A</strong>   B: Soraya says the opinions expressed in the press and journals now are very diﬀerent from earlier ones, but she doesn’t comment on their accuracy. C: She doesn’t attempt to explain or clarify why people have changed their opinions.  <strong>4 B</strong>   A: Halim expresses the opposite opinion: ‘it did go into the pros and cons of the uses of plastic’. C: He also says that the documentary covered the significant points: ‘it covered the main ideas we’d discussed in class’.  <strong>5 B</strong>   A: Jane says parents cope well with their teenage children’s moods, which suggests they do understand them. C: She also suggests that parents do recognise that their children’s needs have changed because they adapt to giving more emotional support.  <strong>6 A</strong>   B: Ed mentions that his son is reluctant to wake up before ten, but this is not what particularly interests him. C: Although he is keen for his son to have a good circle of friends, he doesn’t say that he’s particularly interested in the influence of peers on teenagers.  <strong><em>Audioscript</em></strong>  <strong><em>Extract One</em></strong>  <em>Juliet</em>: Hi, Adam. How are you finding living in Montreal?  <em>Adam</em>: Hi, Juliet. It’s a great city and I’ve got some good buddies now, guys who live on our street and work colleagues. Are you going to the street party to celebrate Canada Day?  <em>Juliet</em>: You bet. It’s a real important thing for me and my family; celebrating it is an annual ritual for us.  <em>Adam</em>: I’ll see you there then; it’s going to be a beautiful day. That sudden shift from biting cold gales to beautifully balmy evenings when you can sit outside in a T-shirt until midnight is what drew me to Montreal. It’s awesome!  <em>Juliet</em>: I know what you mean. So are you staying on in your apartment? I think you said you only leased it for a year?  <em>Adam</em>: Yeah. It makes sense to rent in Montreal – you don’t have to fork out a fortune for a place downtown.  <em>Juliet</em>: You can get a deal because there’s so much on the market.  <em>Adam</em>: And getting a place of my own is, well, financially out of the question. But quite a few people on our street are moving out, right?  <em>Juliet</em>: Yeah, like my sister’s moving again. She wants to be more in the centre.  <em>Adam</em>: Oh, OK.  <strong><em>Extract Two</em></strong>  <em>Halim</em>: Hi, Soraya, how are you getting on with your essay on plastic?  <em>Soraya</em>: Hi, Halim. Well, the background reading’s fascinating. OK, there’s been a complete U-turn in the views expressed in journals and even in the popular press in recent years. But actually, when I read about the 1950s, I get that at that time plastic was seen as revolutionary. You could make anything from it, from bottles to roofs; it was so strong and durable. What was not to like? Whereas now, it’s seen as a real threat to the planet.  <em>Halim</em>: Yeah. I’ve read a couple of really thought-provoking articles and I watched the documentary our tutor recommended, you know the one called <em>Plastic Madness</em>.  <em>Soraya</em>: Oh yeah, any good?  <em>Halim</em>: Wildly over-dramatic at the end, in my view. To be fair, it did go into the pros and cons of the uses of plastic, and it covered the main ideas we’d discussed in class, but <em>to close with statements like Most species of fish will be extinct within ten years was way over the top</em>.  <em>Soraya</em>: And did it go into issues like plastic causing air pollution?  <em>Halim</em>: It did, yeah.  <strong><em>Extract Three</em></strong>  <em>Ed</em>: So, Jane, I’m the parent of a sixteen-year-old, Max, and my wife and I are constantly wondering if we’re doing the right thing.  <em>Jane</em>: The teenage years are critical in human development, Ed. Parents are programmed to care for their child, but in evolutionary terms, the infant must develop, mature and eventually separate from them. And although the majority of parents cope admirably with their child becoming a monosyllabic and at times diﬀicult teenager, few know when to let go. At the same time, parents do generally adapt well to having to provide more emotional support than physical support.  <em>Ed</em>: With Max, we’re going through things like, he seems reluctant to wake up before ten.  <em>Jane</em>: Some schools have changed their timetable to take into account the fact that teenagers perform better later in the day.  <em>Ed</em>: Not his, unfortunately. The good thing is Max and I are both seriously into gaming and I’m fascinated by how so many games promote universal values like hard work pays oﬀ, collaboration works better than confrontation and thinking things through is to be admired. I encourage Max to invite his mates round to our house because I want him to build up a circle of good friends who share common interests. </details>",
        "title": "Test 7"
      }
    },
    {
      "id": "test-8",
      "data": {
        "created_at": {
          "seconds": 1705404263,
          "nanoseconds": 25000000
        },
        "markup": "<p>You will hear a student called Fiona Doyle talking about living in the countryside after growing up in a city. For questions <strong>9-18</strong>, complete the sentences with a word or short phrase.</p> <audio controls src=\"https://engexam.info/wp-content/uploads/2019/07/FCE%20Listening%20Practice%20Test%203,%20Part%202.mp3\"></audio>   <h3 id=\"moving-to-the-countryside\">Moving to the countryside</h3> <p>Fiona says the lack of <strong>9</strong> <strong><strong><em>__</em></strong></strong> in the countryside created a contrast at night.  </p> <p>Some rooms in the house can be rather <strong>10</strong> <strong><strong><em>__</em></strong></strong>  in winter.  </p> <p>At first, the <strong>11</strong> <strong><strong><em>__</em></strong></strong> made it difficult for Fiona to sleep in the house.  </p> <p>Fiona finds she tends to <strong>12</strong> <strong><strong><em>__</em></strong></strong> later in the day than when she was in the city.  </p> <p>In the countryside, Fiona sees <strong>13</strong> <strong><strong><em>__</em></strong></strong> from her bedroom window.  </p> <p>Fiona sometimes finds the slowness of the <strong>14</strong> <strong><strong><em>__</em></strong></strong> where she lives rather irritating.  </p> <p>Out in the countryside, Fiona sometimes can’t get <strong>15</strong> <strong><strong><em>__</em></strong></strong> from friends.  </p> <p>The nearest <strong>16</strong> <strong><strong><em>__</em></strong></strong> is almost two kilometres away from where Fiona lives.  </p> <p>Fiona says you need to have a <strong>17</strong> <strong><strong><em>__</em></strong></strong> in the country, but not in the city.  </p> <p>Fiona won’t have to travel as far to the <strong>18</strong> <strong><strong><em>__</em></strong></strong> as she would from her old home.</p> <details> <summary>Answer&amp;Transcripts</summary>  <strong>9.</strong> street lights<br><strong>10.</strong> damp<br><strong>11.</strong> (total) silence<br><strong>12.</strong> get up<br><strong>13.</strong> rabbits<br><strong>14.</strong> Internet (connection)<br><strong>15.</strong> (mobile) (phone) calls<br><strong>16.</strong> bus stop<br><strong>17.</strong> car<br><strong>18.</strong> university   Tapescript ----------  <strong>Fiona Doyle:</strong> My parents now both work from home so they made the decision to move from our city-centre flat to the countryside, although it meant big changes for the whole family. It was a winter evening when we first went to the village, and as we walked along the pavement <strong>I remarked on how dark it was without the street lights of the city, and how bright that made the lights of the cars seem</strong> <strong>[9]</strong> as they approached. I also noticed the sound of running water, and when we reached the house I was delighted to discover that it stood next to a little bridge over a stream. I soon decided I liked the house. It has thick stone walls, high ceilings and wooden floors. The central heating keeps the temperature in all the rooms pleasant throughout the year, although <strong>during the colder months those in the basement tend to get a bit damp</strong> <strong>[10]</strong>, probably because of the stream. My room is actually on the other side of the house so I don’t hear it at night, which is a pity, really. I was used to the constant big-city background noise of traffic and voices, and <strong>for a while after we moved in I’d keep waking up in the middle of the night owing to the total silence there</strong> <strong>[11]</strong>. It doesn’t bother me now, though, and these days I look forward to settling down for the night in my large, comfortable bed. I rarely stay up any later than when I was in the flat, and <strong>in the mornings I normally wake up at the same time, but there aren’t the sounds of the city telling you it’s time to get up so I’m usually in far less of a hurry to do so</strong> <strong>[12]</strong>. The atmosphere here is so relaxing, and I have a wonderful view from the window of my room. Whereas before I’d see city wildlife like cats, dogs and maybe the occasional fox, <strong>here I start the day to the sound of distant farm animals and the sight of rabbits in the open fields</strong> <strong>[13]</strong>. Apparently there are also deer around, though I haven’t actually spotted any yet. The pace of life in the countryside is certainly slower, but I think I’ve adjusted pretty well to it. I must confess, though, that <strong>I can get a bit fed up with the speed of the Internet connection here</strong> <strong>[14]</strong>, compared with how fast it was in the flat downtown. In spite of that I still manage to chat online with my friends there more or less whenever I want, so I don’t have the feeling of missing them that I thought I might have before I moved. <strong>There is, though, fairly weak mobile reception out here – sometimes no signal at all – and when that happens I may not receive calls they’re trying to make to me</strong> <strong>[15]</strong>, which can be annoying. I suppose poor public transport is another disadvantage of living in the country. There isn’t a railway station within five kilometres, <strong>it’s nearly a two-kilometre walk to get to a bus stop</strong> <strong>[16]</strong>, and taxis charge a fortune to come out here. It’s so different from where I grew up, where the buses stop right outside your home or you can take the Underground.  <strong>You can live quite happily there without a car, but not here</strong> <strong>[17]</strong>. People say ‘why not go by bike?’, but the reality is that it’s just too far to ride anywhere from here – and dangerous on those country roads, especially in the dark. I’ll just have to rely on my parents for lifts everywhere until I pass my driving test, which I hope will be before <strong>I go to university next year. Fortunately, it’ll be a shorter drive from here than from where I used to live</strong> <strong>[18]</strong>, and I’ll avoid the awful traffic on the roads in and out of the city, too!<br></details>",
        "title": "Test 8"
      }
    },
    {
      "id": "test-9",
      "data": {
        "created_at": {
          "seconds": 1705404278,
          "nanoseconds": 563000000
        },
        "title": "Test 9",
        "markup": "<p>You will hear a history student, called Kylie, giving a presentation to her class about an archaeological site in Egypt called Beni Hassan. For questions <strong>7-14</strong>, complete the sentences with a word or short phrase.</p> <audio controls src=\"https://englishpracticetest.net/wp-content/uploads/2021/11/cae-practice-listening-test-02-part-2.mp3\"></audio>   <p><strong>BENI HASSAN ARCHAEOLOGICAL SITE</strong></p> <p>The tombs that fascinate Kylie are the ones where (<strong>7</strong>) ………………………………… who worked for the government were buried.</p> <p>The paintings on the walls of many tombs show a good understanding of the (<strong>8</strong>) ………………………………… of animals.</p> <p>Kylie explains that the paint was made by grinding up various (<strong>9</strong>) ………………………………… before it was applied to the walls.</p> <p>The annual harvest, where (<strong>10</strong>) ………………………………… was gathered, is found in some of the paintings that Kylie has been.</p> <p>Kylie agrees that the wrestling scenes show that (<strong>11</strong>) ………………………………… underwent rigorous training.</p> <p>Kylie has found out that birds that are flying are thought to represent (<strong>12</strong>) ………………………………… in the paintings.</p> <p>Animals such as (<strong>13</strong>) ………………………………… were used to help hunters catch other animals.</p> <p>Kylie explains that creatures made up of two different animals show the (<strong>14</strong>) ………………………………… of the ancient people’s religious beliefs.</p> <details> <summary>Answer &amp; Audioscript</summary>  <strong>7 oﬀicials</strong>   The tombs of servants were less elaborate and therefore, it is implied, of less interest.   <strong>8 behaviour / behavior</strong>   ‘show a keen observation of’ reflects ‘show a good understanding of’ in the question.  <strong>9 minerals</strong>   ‘The paint … has been analysed and found to be made from ground minerals’ is a paraphrase of the gapped sentence.  <strong>10 grain</strong>   ‘Some other paintings depict annual important events, such as the grain harvest’ is a paraphrase of the gapped sentence.  <strong>11 soldiers</strong>   Both sportsmen and soldiers are mentioned, but it’s only soldiers that Kylie links with training and it’s this interpretation of the paintings that she agrees with.  <strong>12 invasion</strong>   Birds in flight are symbols of invasion, whereas a bird being caught by a hunter represents victory over an enemy.  <strong>13 crocodiles</strong>   Cats are also mentioned, but they appear in many paintings because local people worshipped a cat goddess.  <strong>14 complexity</strong>   ‘These “mixed” creatures express the complexity of how the afterlife was conceived and formed part of religious worship’ is a paraphrase of the gapped sentence.  <strong><em>Audioscript</em></strong>  I’m going to tell you about an archaeological site called Beni Hassan. It’s located on the east bank of the Nile in central Egypt and it dates back to the 11th and 12th Dynasties of Egypt’s Middle Kingdom; that’s 2050–1650 BCE. The site and its decorated tombs not only tell us about the artists who worked on the tombs, but also reflect the lives of the people buried there. The tombs that interest me most are those of government oﬀicials. Their servants wouldn’t have had such elaborate tombs.  In the paintings on the walls, there’s a wonderful variety of fauna and flora, and you can even see some plants and animals that you don’t often find in Egyptian art. Many of the tombs at Beni Hassan include full-panel representations of animals and show a keen observation of their behaviour, usually while they are out in the wild, typically in habitats such as marshes or deserts.  The paint that was used to decorate tombs has been analysed and found to be made from ground minerals; it was sometimes applied straight onto the walls of the tombs, and at other times onto a sort of base made of plaster. Although I’ve said that the scenes painted were very varied, you do find the same, or very similar, scenes repeat ed in several tombs. This could well suggest that certain images were considered an essential part of any memorial.  Some other paintings depict important annual events, such as the grain harvest and its shipment to other parts of the kingdom. I know the Ancient Egyptians also grew vegetables, but I couldn’t see any in the photos of the paintings I saw. Other paintings show people wrestling. These are quite detailed, showing all kinds of diﬀerent grips and holds. At first, it was thought these scenes were there to demonstrate the strength of sportsmen, but now it’s believed that they are intended to illustrate soldiers during their training. And, as it was important to show admiration of the power of the kingdom in those times, I tend to agree with this latest interpretation.  Interestingly, I discovered that birds in flight, which appear in many of the paintings, are symbols of invasion, so when there’s a bird being caught by a hunter, it represents victory over an enemy. Hunters are also shown using animals as a sort of tool to catch other animals. For instance, crocodiles catching birds. Cats also appear in many paintings because local people worshipped a cat goddess called Pakhet, meaning ‘the scratcher’.  As in many other tombs in Egypt, there are images of creatures that are half one animal and half another. In one of the tombs at Beni Hassan, there’s one creature with the head of a falcon and the body of a dog. These ‘mixed’ creatures express the complexity of how the afterlife was conceived and formed part of religious worship.  </details>"
      }
    },
    {
      "id": "test10",
      "data": {
        "markup": "<p>Listening Part 2</p> <p>You will hear a boy called Harry telling his class about an art event he took part in recently. For questions 9-18, complete the sentences with a word or short phrase.</p> <audio src=\"https://englishpracticetest.net/wp-content/uploads/2021/11/fce-practice-listening-test-05-part-2.mp3\" controls></audio>  <p>Art Day Fiona, the person running the art day, had once worked as a (9) …………………………………… . Harry uses the word (10) …………………………………… to describe his feelings when he first arrived. Harry was inspired by the variety of (11) …………………………………… paper in the drawing book he was given. Harry put a (12) …………………………………… on the cover of his drawing book. Harry first painting was a (13) …………………………………… . Harry was particularly impressed by the (14) …………………………………… that another student had done. With Fiona’s help, Harry attempted a more (15) …………………………………… style of drawing than he’s tried when he started. After lunch, the group chose the theme of (16) …………………………………… for the sculpture they intended to make together. Harry found a collection of (17) …………………………………… to include in the sculpture. The (18) …………………………………… of the art group was what made Harry decide to sign up for the next session.</p> <details> <summary>Answer &amp; Audioscript</summary>  9 (fashion) designer<br>10 anxious<br>11 recycled  12 dragon<br>13 landscape<br>14 cartoons<br>15 abstract  16 nature<br>17 feathers<br>18 enthusiasm   <h2>Audioscript</h2> Hello, everyone. I want to tell you about an event I attended at the art centre near our town recently – an art day for teenagers! It was fantastic! The whole day was run by a woman called Fiona, who’s well-known as a filmmaker in our town. But she’d also worked previously as a fashion designer, and is a painter in her spare time, so she knew a lot about art. Usually when I’m faced with new situations, I’m quite self-confident, and find it easy to chat to people. This time, for some reason, I was aware of being anxious as I got to the centre – I guess in case everyone was brilliant at art, and I wasn’t! In fact, though, all the people there were really friendly! To begin the session, Fiona gave us all a drawing book, so we could record our ideas and do initial drawings. I’d expected it to contain instructions about what we were going to do – and sort of hoped it might have pictures for us to copy! Instead, it turned out the book had lots of different types of recycled paper in it, which I really approved of, as I’m always trying to help look after the environment. It also made me want to get creative! First, Fiona asked us to decorate the cover of the drawing book. I tried to create something using a photo of myself I’d brought along, but then decided it looked boring, so I ended up decorating it with a dragon – which everyone liked! Then after we’d done a few drawings in our books, we moved on to doing some painting – but I couldn’t really think what to paint. Fiona saw I needed help, and suggested doing a portrait of the girl next to me. That sounded hard – so, as the centre was out in the country, I decided to do a landscape instead, as it wouldn’t matter so much if it wasn’t very good! After a while, Fiona suggested we have a break and look at what other people had done. One person had done some animal drawings, which were quite good, and someone else had produced some cartoons, which I thought were the best in the group. I was a bit discouraged after that, but some people said my stuff was good, too, so I kept going! I soon decided that my painting was looking a bit traditional, and as there were some amazing colourful paints available, I used them to make my work more abstract. With Fiona’s help, I focused on creating something in that style, and the result was fantastic – much better than when I’d started. After lunch, Fiona proposed a new activity – working together to make a big sculpture from wire and cardboard based on a theme chosen by the group. Fiona had brought along some objects from home, and suggested those as a theme – but we thought it might be too limited. The theme of the sea was also rejected, as we were far from the coast and ideally we wanted our sculpture to reflect our local area. Finally we decided that as we were near the forest, we’d look for objects for the project there. We all agreed this was a task we could tackle. Anyway, we made an enormous tree sculpture, and then went off to search for objects to decorate it with. I wondered about bringing things like wild flowers to hang in the tree, but Fiona reminded me we weren’t allowed to pick them. Then I noticed people seemed to be collecting leaves, so I started picking up feathers I saw on the ground, which were a great contribution to the sculpture! It was a wonderful day – and Fiona filmed our work as a souvenir for us! All the people there had real talent, and showed a great commitment to producing art. They were also fun and had loads of enthusiasm, which was the key thing for me. I’ve already booked for the next art day – just being with them was really inspirational! </details>",
        "title": "Test 10",
        "created_at": {
          "seconds": 1705404663,
          "nanoseconds": 547000000
        }
      }
    },
    {
      "id": "test11",
      "data": {
        "title": "Test 11",
        "markup": "<h2 id=\"part-1\">Part 1</h2> <p>You will hear three different extracts. For questions 1-6, choose the answer (A, В or C) which fits best according to what you hear. There are two questions for each extract.</p> <p><audio controls src=\"https://engexam.info/wp-content/uploads/2017/01/CAE-1-1-1.mp3?_=1\"></audio></p> <h3 id=\"extract-one\">Extract One</h3> <p>You hear part of an interview with a woman who works in retail management.</p> <p>1.How does the woman feel now about her first job in retailing?</p> <p>A pleased by the way she handled the staff</p> <p>В confident that it gave her a good start</p> <p>C relaxed about the mistakes she made</p> <p>2.What is the woman advised to do next?</p> <p>A reflect on her skills</p> <p>В volunteer for extra work</p> <p>C discuss her situation with her boss</p> <h3 id=\"extract-two\">Extract Two</h3> <p>You overhear a woman telling a friend a story about a swan.</p> <p>3.What problem did the woman have with the swan?</p> <p>A She misunderstood its intentions.</p> <p>В She underestimated the speed of its approach.</p> <p>C She failed to realise the consequences of disturbing it.</p> <p>4.What is the man’s reaction to the story?</p> <p>A He feels he would have handled the situation  better.</p> <p>В He is unconvinced by the woman’s version of events.</p> <p>C He fails to see quite how serious the problem was.</p> <h3 id=\"extract-three\">Extract Three</h3> <p>You hear part of an interview with Bruce Loader, a successful businessman who is talking about his early life.</p> <p>5.Why did Bruce decide to give up the idea of studying art?</p> <p>A He failed to gain a place at art college.</p> <p>В He became tired of doing representational art.</p> <p>C He was persuaded that he could not realise his ambition.</p> <p>6.What was his father’s reaction to Bruce’s decision?</p> <p>A He was anxious to discuss alternative employment options.</p> <p>В He was angry that a good opportunity had been wasted.</p> <p>C He was dismissive of the advantages of higher education.</p> <details> <summary>Answers</summary> 1. B 2. A 3. C 4. C 5. C 6. B <h2>Transcript</h2> Extract 1<br> Interviewer: So, Fiona, can you tell me about how you started in fashion retailing? Fiona: Yes, of course. After I finished university, I took a job with a big high street chain - I was an assistant manager. Every week you would see the sales figures for your product and then act on that by placing repeat orders or putting a new style in. It was a good grounding [1]. However, most of the staff had been there years and I think I did make mistakes in my dealings with them - I blush now to think of my time there. I then moved on, after five years, to my present job. Interviewer: And now you’re thinking of moving up the ladder. How do you see yourself in ten years’ time? Fiona: I would eventually like to be in senior management. Interviewer: Well, before you rush off to see your line manager, I think you need to work out skills you can offer emphasising your selling points, showing them what you can do [2]. Also have you been going the extra mile to get things done or doing more than what is asked of you, recently?<br> Extract 2<br> Friend: So, what happened last weekend? Woman: Well, we were taking our boat along the river, when we passed a pair of swans, with a nest nearby. One swan just carried on feeding, but the other one - the male I think - decided to come and investigate. Friend: Oh, fantastic. I’ve never seen a swan’s nest close up. I expect he was hungry. Woman: Well, actually it was immediately obvious from his body language that he had other things on his mind. He was flapping his wings really hard, and approaching at incredible speed. And I guess we’d gone too close to the nest. I’d never have done that if I’d known what would happen [3]. Friend: Gosh, amazing. I’ve never heard of swans behaving like that before. So what did you do? Row like mad? Woman: Well, we got out onto the bank, but he followed us up, and then stood between us and the boat for about an hour! We just couldn’t frighten him away. Friend: No, I suppose not. Still, I’m sure he wouldn’t have hurt you. Woman: Are you kidding [4]? You should have seen the way he moved - swans can be really aggressive at nesting times. Friend: Hmm.<br> Extract 3<br> Interviewer: Bruce, at school, you discovered you had a natural talent for art. Bruce: Yes, I inherited my dad’s gift for drawing. I wanted to do representational art; paint portraits. But every college I went to - and there were three who accepted me - all the college tutors said, ‘Forget representational art, get a single lens reflex 33-millimetre camera, hit the shutter, crash, there’s your picture. Not even Rembrandt could get that accuracy, so it’s not worth it [5].’ Interviewer: And you believed them? Bruce: I did. That was my biggest mistake. I haven’t picked up a paintbrush since. Interviewer: How did your father react, when you told him you weren’t going to art college? Bruce: His face was white with rage [6]. He said, ‘Right, that’s it. You could have made something of going to college. You won’t get another chance. Now I’ve got a perfectly good job for you on the factory floor. You start this week - take it or leave it.’ I said, ‘No, I’m going to start a business next.’ He said, ‘Well, at your own expense, then.’ Interviewer: He refused to support you any more? Bruce: That’s it, and so... </details>"
      }
    }
  ]